Repository: gitGNU/gnu_www-pt-br
Catalog: graphics/dog.*.po
Languages: pt_br

source: Dog Cartoon - GNU Project - Free Software Foundation
pt_br: Imagem de Cachorro - Projeto GNU - Free Software Foundation

source: Dog Cartoon
pt_br: Imagem de Cachorro

source: [Dog, wondering at pop-up ads]
pt_br: [Cachorro, em dúvida sobre umas propagandas]

source: A cute beagle is sitting by his computer, which shows pop-up ads for a yummy bone, a dog toy, and a comfortable-looking doggy bed. These ads partially cover the text of an article by Richard Stallman, <a href="/philosophy/surveillance-vs-democracy">How Much Surveillance Can Democracy Withstand?</a> (only visible in the large picture). The dog is wondering, <em>&ldquo;How did they find out I'm a dog?&rdquo;</em>
pt_br: Um beagle fofo está sentado próximo ao seu computador, que mostra propagandas para um osso delicioso, um brinquedo de cachorro e uma cama de cachorro que parece confortável. Essas propagandas cobrem o texto de um artigo por Richard Stallman, <a href="/philosophy/surveillance-vs-democracy">Qual o Nível de Vigilância Que a Democracia Pode Suportar?</a> (visível apenas na imagem grande). O cachorro está se perguntando <em>“Como descobriram que eu sou um cachorro”</em>

source: This picture is available in the following formats:
pt_br: Essa imagem está disponível nos seguintes formatos:

source: small jpg <a href="/graphics/dog.small.jpg">58kB</a>
pt_br: jpg pequeno <a href="/graphics/dog.small.jpg">58kB</a>

source: large jpg <a href="https://stallman.org/images/dog.jpg">6.5MB</a>
pt_br: jpg grande <a href="https://stallman.org/images/dog.jpg">6,5MB</a>

source: It is released under the <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivs 4.0 International License</a>.
pt_br: Ela foi lançada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Atribuição-SemDerivações 4.0 Internacional</a>.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: Copyright &copy; 2014, 2016 Richard Stallman and Antonomakia
pt_br: Copyright &copy; 2014, 2016 Richard Stallman e Antonomakia

source: This image is available for use under the terms of the <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivs 4.0 International License</a>.
pt_br: Essa imagem está disponível sob os termos da licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.pt_BR">Creative Commons Atribuição-SemDerivações 4.0 Internacional</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: <b>Tradução:</b> Rafael Fontenelle <a href="mailto:rafaelff@gnome.org">&lt;rafaelff@gnome.org&gt;</a>

source: Updated:
pt_br: Última atualização:
