Repository: gitGNU/gnu_www-pt-br
Catalog: licenses/gpl-howto.*.po
Languages: pt_br

source: How to use GNU licenses for your own software - GNU Project - Free Software Foundation
pt_br: Como usar as licenças GNU para seu próprio software - Projeto GNU - Free Software Foundation

source: How to use GNU licenses for your own software
pt_br: Como usar as licenças GNU para seu próprio software

source: This is a brief explanation of how to place a program under the <a href="/licenses/gpl.html">GNU General Public License</a>, <a href="/licenses/lgpl.html">Lesser General Public License</a>, or <a href="/licenses/agpl.html">Affero General Public License</a>. For the <a href="/licenses/fdl.html">GNU Free Documentation License</a>, we have a <a href="/licenses/fdl-howto.html">separate page</a>.
pt_br: Esta é uma breve explicação de como colocar um programa sob a <a href="/licenses/gpl.html"> Licença Pública Geral GNU (GPL)</a>, <a href="/licenses/lgpl.html">Licença Pública Geral Menor (LGPL)</a> ou <a href="/licenses/agpl.html">Licença Pública Geral Affero (AGPL)</a>. Para a <a href="/licenses/fdl.html">Licença de Documentação Livre GNU (FDL)</a>, nós temos uma <a href="/licenses/fdl-howto.html">página separada</a>.

source: If you are looking for more detailed information, consider perusing our list of <a href="/licenses/gpl-faq.html">frequently asked questions about our licenses</a>.
pt_br: Se você está procurando por informações mais detalhadas, considere examinar nossa lista de <a href="/licenses/gpl-faq.html">perguntas frequentes sobre nossas licenças</a>.

source: If you are considering using the GNU Lesser General Public License, please read the article &ldquo;<a href="/licenses/why-not-lgpl.html">Why you shouldn't use the LGPL for your next library</a>&rdquo; first. The article explains why it may be better to use the ordinary GPL instead, and how we would make the decision.
pt_br: Se você está considerando usar a Licença Pública Geral Menor GNU, por favor, leia antes o artigo “<a href="/licenses/why-not-lgpl.html">Por que você não deve usar a LGPL para a sua próxima biblioteca</a>”. O artigo explica por que pode ser melhor usar a GPL comum, e como nós devemos tomar esta decisão.

source: Whichever license you plan to use, the process involves adding two elements to each source file of your program: a copyright notice (such as &ldquo;Copyright 1999 Terry Jones&rdquo;), and a statement of copying permission, saying that the program is distributed under the terms of the GNU General Public License (or the Lesser GPL).
pt_br: Seja qual licença você planeja usar, o processo envolve a adição de dois elementos em cada arquivo fonte do seu programa: uma nota de copyright (como “<cite>Copyright 1999 Terry Jones</cite>”) e uma declaração de permissão de cópia, dizendo que o programa é distribuído sobre os termos da Licença Pública Geral GNU (ou da GPL Menor).

source: The copyright notice should include the year in which you finished preparing the release (so if you finished it in 1998 but didn't post it until 1999, use 1998). You should add the proper year for each release; for example, &ldquo;Copyright 1998, 1999 Terry Jones&rdquo; if some versions were finished in 1998 and some were finished in 1999. If several people helped write the code, use all their names.
pt_br: A nota de copyright deve incluir o ano no qual você acabou de preparar a versão de lançamento (então, se você acabou em 1998 e não publicou até 1999, use 1998). Você deve adicionar o ano de cada versão de lançamento; por exemplo, se algumas versões foram terminadas em 1998 e outras em 1999 “Copyright 1998, 1999 Terry Jones”. Se várias pessoas ajudaram a escrever o código, inclua os nomes de todos elas.

source: For software with several releases over multiple years, it's okay to use a range (&ldquo;2008-2010&rdquo;) instead of listing individual years (&ldquo;2008, 2009, 2010&rdquo;) if and only if every year in the range, inclusive, really is a &ldquo;copyrightable&rdquo; year that would be listed individually; <em>and</em> you make an explicit statement in your documentation about this usage.
pt_br: Para softwares com vários lançamentos ao longo de muitos anos, não há problema em usar um intervalo (“2008-2010”) em vez de listar anos individuais (“2008, 2009, 2010”) se, e somente se, todos os anos no intervalo realmente forem anos “copyrightáveis” que seriam listados individualmente; <em>e</em> você faria uma declaração explícita em sua documentação sobre esse uso.

source: Always use the English word &ldquo;Copyright&rdquo;; by international convention, this is used worldwide, even for material in other languages. The copyright symbol &ldquo;&copy;&rdquo; can be included if you wish (and your character set supports it), but it's not necessary. There is no legal significance to using the three-character sequence &ldquo;(C)&rdquo;, although it does no harm.
pt_br: Sempre use a palavra em inglês “Copyright”; por convenção internacional, ela é usada mundialmente, mesmo para materiais em outros idiomas. O símbolo de copyright “&copy;” pode ser incluído se você assim desejar (e seu conjunto de caracteres prover suporte para isso), mas não há necessidade. Não há significância legal em usar a sequência de três caracteres “(C)”, apesar de não haver problema.

source: You should also include a copy of the license itself somewhere in the distribution of your program. All programs, whether they are released under the GPL or LGPL, should include <a href="/licenses/gpl.txt">the text version of the GPL</a>. In GNU programs the license is usually in a file called COPYING.
pt_br: Você também deve incluir uma cópia da licença em algum lugar da distribuição do seu programa. Todos os programas, lançados sob a GPL ou sob a LGPL, devem incluir <a href="/licenses/gpl.txt">a versão texto da GPL</a>. Nos programas GNU, a licença é geralmente colocada num arquivo chamado COPYING.

source: If you are releasing your program under the LGPL, you should also include <a href="/licenses/lgpl.txt">the text version of the LGPL</a>, usually in a file called COPYING.LESSER. Please note that, since the LGPL is a set of additional permissions on top of the GPL, it's important to include both licenses so users have all the materials they need to understand their rights.
pt_br: Se você está relançando seu programa sob a LGPL, você também deve incluir <a href="/licenses/lgpl.txt">a versão texto da LGPL</a>, geralmente em um arquivo chamado COPYING.LESSER. Por favor note que, já que LGPL é um conjunto de permissões adicionais em cima da GPL, é importante incluir ambas licenças de forma que usuários tenham todos os materiais que eles precisem para entender seus direitos.

source: If you are releasing your program under the GNU AGPL, you only need to include <a href="/licenses/agpl.txt">the text version of the GNU AGPL</a>.
pt_br: Se você está relançando seu programa sob a GNU AGPL, você só precisa incluir <a href="/licenses/agpl.txt">a versão texto da GNU AGPL</a>.

source: If you have copied code from other programs covered by the same license, copy their copyright notices too. Put all the copyright notices together, right near the top of each file.
pt_br: Se você copiou o código de outros programas regidos pela mesma licença, copie as notas de copyright também. Coloque todos os copyright juntos, no lado direito, perto do topo de cada arquivo.

source: It is very important for practical reasons to include contact information for how to reach you, perhaps in the README file, but this has nothing to do with the legal issues of applying the license.
pt_br: É muito importante, por razões práticas, incluir informações de contato para quem quiser entrar contato com você, talvez no arquivo “README”, mas isso não tem nada a ver com os casos legais de aplicação da licença.

source: The copying permission statement should come right after the copyright notices. For a one-file program, the statement (for the GPL) should look like this:
pt_br: A declaração da permissão de cópia deve vir depois das notas de copyright. Para um arquivo de programa, a declaração (para a GPL) deve parecer com isso:

source: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see &lt;http://www.gnu.org/licenses/&gt;.
pt_br: This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this program. If not, see &lt;http://www.gnu.org/licenses/&gt;. Tradução não oficial: Este programa é um software livre; você pode redistribuí-lo e/ou modificá-lo sob os termos da Licença Pública Geral GNU como publicada pela Fundação do Software Livre (FSF); na versão 3 da Licença, ou (a seu critério) qualquer versão posterior. Este programa é distribuído na esperança de que possa ser útil, mas SEM NENHUMA GARANTIA; sem uma garantia implícita de ADEQUAÇÃO a qualquer MERCADO ou APLICAÇÃO EM PARTICULAR. Veja a Licença Pública Geral GNU para mais detalhes. Você deve ter recebido uma cópia da Licença Pública Geral GNU junto com este programa. Se não, veja &lt;http://www.gnu.org/licenses/&gt;.

source: For programs that are more than one file, it is better to replace &ldquo;this program&rdquo; with the name of the program, and begin the statement with a line saying &ldquo;This file is part of NAME&rdquo;. For instance,
pt_br: Para programas com mais de um arquivo, é melhor substituir o “this program” (“este programa”) pelo nome do programa, e começar a declaração com “This file is part of NAME” (“Este arquivo é parte do programa NOME”). Por exemplo,

source: This file is part of Foobar. Foobar is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. Foobar is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with Foobar. If not, see &lt;http://www.gnu.org/licenses/&gt;.
pt_br: This file is part of Foobar. Foobar is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. Foobar is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with Foobar. If not, see &lt;http://www.gnu.org/licenses/&gt;. Tradução não oficial: Este arquivo é parte do programa Foobar Foobar é um software livre; você pode redistribuí-lo e/ou modificá-lo dentro dos termos da Licença Pública Geral GNU como publicada pela Fundação do Software Livre (FSF); na versão 3 da Licença, ou (a seu critério) qualquer versão posterior. Este programa é distribuído na esperança de que possa ser útil, mas SEM NENHUMA GARANTIA; sem uma garantia implícita de ADEQUAÇÃO a qualquer MERCADO ou APLICAÇÃO EM PARTICULAR. Veja a Licença Pública Geral GNU para maiores detalhes. Você deve ter recebido uma cópia da Licença Pública Geral GNU junto com este programa, Se não, veja &lt;http://www.gnu.org/licenses/&gt;.

source: This statement should go near the beginning of every source file, close to the copyright notices. When using the Lesser GPL, insert the word &ldquo;Lesser&rdquo; before &ldquo;General&rdquo; in <em>all three</em> places. When using the GNU AGPL, insert the word &ldquo;Affero&rdquo; before &ldquo;General&rdquo; in <em>all three</em> places.
pt_br: Este documento deve ir no começo de cada arquivo fonte, perto das notas de copyright. Ao usar a GPL Menor, coloque a palavra “<cite>Lesser</cite>” antes de “<cite>General</cite>” em <em>todos os três</em> lugares. Ao usar a GNU AGPL, coloque a palavra “<cite>Affero</cite>” antes de “<cite>General</cite>” em <em>todos os três</em> lugares.

source: For interactive programs, it is usually a good idea to make the program print out a brief notice about copyright and copying permission when it starts up. See <a href="/licenses/gpl-3.0.html#howto">the end of the GNU GPL</a> for more information about this.
pt_br: Para programas interativos, é uma boa ideia fazer o programa escrever na tela uma breve nota de copyright e de permissão de cópia quando ele começar. Veja <a href="/licenses/gpl-3.0.html#howto">o final da GPL GNU</a> para mais informação sobre isso.

source: If you are releasing your program under the GNU AGPL, and it can interact with users over a network, the program should offer its source to those users in some way. For example, if your program is a web application, its interface could display a &ldquo;Source&rdquo; link that leads users to an archive of the code. The GNU AGPL is flexible enough that you can choose a method that's suitable for your specific program&mdash;see section 13 for details.
pt_br: Se você está relançando seu programa sob a GNU AGPL, e ele pode interagir com usuários pela rede, o programa deve oferecer seu fonte para aqueles usuários de alguma forma. Por exemplo, se seu programa é um aplicativo web, sua interface poderia exigir um link “<cite>Source</cite>” que leva os usuários para um pacote do código. A GNU AGPL é flexível o suficiente para permitir que você escolha um método que seja mais adequado para seu programa específico&mdash;veja seção 13 para detalhes.

source: There is no legal requirement to register your copyright with anyone; simply distributing the program makes it copyrighted. However, it is a very good idea to register the copyright with the US Registry of Copyrights, because that puts you in a stronger position against anyone who violates the license in the US. Most other countries have no system of copyright registration.
pt_br: Não há requisitos legais para registrar o seu copyright em qualquer lugar; a simples distribuição do programa o torna protegido por copyright. Contudo, é uma boa ideia registrar o copyright no escritório de registros de Copyrights dos EUA (<cite>US Copyright Office</cite>), o que coloca você em uma forte posição contra quem violar a sua licença nos EUA. A maioria dos países não possuem um sistema de registro de copyright.

source: It's wise to ask your employer or school, if any, to sign a copyright disclaimer for the work, so they cannot claim to hold it later. Below is a sample copyright disclaimer; just alter the names and program description as appropriate:
pt_br: É aconselhável solicitar que seu empregador ou sua escola, se for o caso, assine um aviso legal de renúncia de copyright para a obra, de forma que eles não possam, posteriormente, alegar serem detentores desta. Abaixo está um exemplo de aviso legal de renúncia de copyright; basta alterar nomes e descrição do programa conforme apropriado:

source: Yoyodyne, Inc., hereby disclaims all copyright interest in the program &ldquo;Gnomovision&rdquo; (which makes passes at compilers) written by James Hacker.
pt_br: Yoyodyne, Inc., por meio deste renuncia todo e qualquer interesse no copyright do programa “Gnomovision” (que criar passes em compiladores) escrito por James Hacker.

source: &lt;signature of Moe Ghoul&gt;, 1 April 1989
pt_br: &lt;assinatura de Moe Ghoul&gt;, 1ª de Abril de 1989

source: Moe Ghoul, President of Vice
pt_br: Moe Ghoul, Presidente da Vice

source: We would like to list all free software programs in the Free Software Directory, including all programs licensed under the GPL (any version). Please see the <a href="http://directory.fsf.org/">Directory web page</a> for information and an online submission form.
pt_br: Nós gostaríamos de listar todos programas de software livre no Diretório de Software Livre, inclusive todos aqueles licenciados sob a GPL (qualquer versão). Por favor, consulte a <a href="http://directory.fsf.org/">página do Diretório</a> para obter informações e um formulário de submissão on-line.

source: It is also possible to make your program a GNU package, a part of the GNU Project. (That's if we like the program&mdash;we have to look at it first, and decide.) If you might be interested in joining up with the GNU Project in this way, please see our <a href="/help/evaluation.html">GNU software evaluation page</a> for more information and a short questionnaire.
pt_br: Também é possível fazer do seu programa um pacote GNU, uma parte do Projeto GNU. (Isto é, se nós gostarmos do programa&mdash;analisaremos primeiro antes de decidir.) Se lhe interessa entrar no Projeto GNU por essa maneira, por favor consulte a nossa <a href="/help/evaluation.html">página de avaliação do software GNU</a> para obter mais informações e um breve questionário.

source: But you are welcome to use any of our licenses even if your program is not a GNU package; indeed, we hope you will. They're available to everyone. If you'd like to advertise your use of a particular license, feel free to use <a href="/graphics/license-logos.html" title="GNU License Logos">one of our logos</a>.
pt_br: Contudo, você pode usar qualquer uma de nossas licenças mesmo se seu programa não for um pacote GNU; de fato, esperamos que você o faça. Elas estão disponíveis para todo mundo. Se você gostaria de divulgar seu uso de uma licença específica, sinta-se à vontade para usar <a href="/graphics/license-logos.html" title="GNU License Logos">uma de nossas logos</a>.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
pt_br: Esta página está licenciada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.pt_BR">Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: <b>Traduzido por</b>: Hélder M. Botter Ribas <a href="mailto:helder@grad.icmc.sc.usp.br">&lt;helder@grad.icmc.sc.usp.br&gt;</a>, 2001; Rafael Fontenelle <a href="mailto:rafaelff@gnome.org">&lt;rafaelff@gnome.org&gt;</a>, 2017

source: Updated:
pt_br: Última atualização:
