Repository: gitGNU/gnu_www-pt-br
Catalog: licenses/licenses.*.po
Languages: pt_br

source: Licenses - GNU Project - Free Software Foundation
pt_br: Licenças - Projeto GNU - Free Software Foundation

source: Licenses
pt_br: Licenças

source: Table of Contents
pt_br: Conteúdo

source: <a href="#Evaluation">Evaluating Licenses</a>
pt_br: <a href="#Evaluation">Avaliação de Licenças</a>

source: <a href="#CommonResources">Common Resources for our Software Licenses</a>
pt_br: <a href="#CommonResources">Recursos Comuns para nossas Licenças de Software</a>

source: <a href="#GPL">The GNU General Public License</a>
pt_br: <a href="#GPL">A Licença Pública Geral GNU</a>

source: <a href="#LGPL">The GNU Lesser General Public License</a>
pt_br: <a href="#LGPL">A Licença Pública Geral Menor GNU</a>

source: <a href="#AGPL">The GNU Affero General Public License</a>
pt_br: <a href="#AGPL">A Licença Pública Geral Affero GNU</a>

source: <a href="#FDL">The GNU Free Documentation License</a>
pt_br: <a href="#FDL">A Licença de Documentação Livre GNU</a>

source: <a href="#Exceptions">Exceptions to GNU Licenses</a>
pt_br: <a href="#Exceptions">Exceções às Licenças GNU</a>

source: <a href="#LicenseURLs">License URLs</a>
pt_br: <a href="#LicenseURLs">URLs das Licenças</a>

source: <a href="#UnofficialTransl">Unofficial Translations</a>
pt_br: <a href="#UnofficialTransl">Lista de traduções extra-oficiais</a>

source: <a href="#VerbatimCopying">Verbatim Copying and Distribution</a>
pt_br: <a href="#VerbatimCopying">Cópias Exatas e Distribuição</a>

source: <a href="#FSLicenses">List of Free Software Licenses</a>
pt_br: <a href="#FSLicenses">Lista de licenças de software livre</a>

source: <a href="#WhatIsCopyleft">What Is Copyleft?</a>
pt_br: <a href="#WhatIsCopyleft">O Que É Copyleft?</a>

source: <a href="#OtherWorks">Licenses for Other Types of Works</a>
pt_br: <a href="#OtherWorks">Licenças para Outros Tipos de Obras</a>

source: Published software should be <a href="/philosophy/free-sw.html">free software</a>. To make it free software, you need to release it under a free software license. We normally use the <a href="#GPL">GNU General Public License</a> (GNU GPL), but occasionally we use <a href="/licenses/license-list.html#SoftwareLicenses">other free software licenses</a>. We use only licenses that are compatible with the GNU GPL for GNU software.
pt_br: Um software publicado deve ser <a href="/philosophy/free-sw.html">software livre</a>. Para torná-lo software livre, você precisa liberá-lo sob uma licença software livre. Normalmente, usamos a <a href="#GPL">Licença Pública Geral GNU</a> (GNU GPL), mas ocasionalmente usamos <a href="/licenses/license-list.html#SoftwareLicenses">outras licenças de software livre</a>. Nós usamos apenas licenças que são compatíveis com a GNU GPL para softwares GNU.

source: Documentation for free software should be <a href="/philosophy/free-doc.html">free documentation</a>, so that people can redistribute it and improve it along with the software it describes. To make it free documentation, you need to release it under a free documentation license. We normally use the <a href="#FDL">GNU Free Documentation License</a> (GNU FDL), but occasionally we use <a href="/licenses/license-list.html#DocumentationLicenses">other free documentation licenses</a>.
pt_br: Documentação de software livre deve ser uma <a href="/philosophy/free-doc.html">documentação livre</a>, de forma que pessoas podem redistribui-la e melhorá-la junto com o software que ela descreve. Para torná-la uma documentação livre, você precisa liberá-la sobre uma licença de documentação livre. Normalmente, usamos a <a href="#FDL">Licença de Documentação Livre GNU</a> (GNU FDL), mas ocasionalmente usamos <a href="/licenses/license-list.html#DocumentationLicenses">outras licenças de documentação livre</a>.

source: If you've started a new project and you're not sure what license to use, <a href="/licenses/license-recommendations.html">&ldquo;How to choose a license for your own work&rdquo;</a> details our recommendations in an easy-to-follow guide. If you just want a quick list reference, we have a page that names our <a href="/licenses/recommended-copylefts.html">recommended copyleft licenses</a>.
pt_br: Se você iniciou um novo projeto e não tem certeza qual licença deve usar, <a href="/licenses/license-recommendations.html">“Como escolher uma licença para seu próprio trabalho”</a> detalha suas recomendações em um guia fácil de seguir. Se você deseja apenas uma referência rápida de lista, nós temos uma página que relaciona essas <a href="/licenses/recommended-copylefts.html">licenças copyleft recomendadas</a>.

source: We also have a page that discusses <a href="/licenses/bsd.html">the BSD License Problem</a>.
pt_br: Temos também uma página que discute <a href="/licenses/bsd.html">o problema da Licença BSD</a>.

source: Evaluating Licenses
pt_br: Avaliações de Licenças

source: If you come across a license not mentioned in our <a href="/licenses/license-list.html">license list</a>, you can ask us to evaluate whether it is a free license. Please email a copy of the license (and the URL where you found it) to <a href="mailto:licensing@fsf.org">licensing@fsf.org</a>. Our licensing experts in the staff and the board of directors will review it. If the license has some unusual conditions, they may pose difficult philosophical problems, so we can't promise to decide quickly.
pt_br: Se você se deparar com uma licença não mencionada em nossa <a href="/licenses/license-list.html">lista de licenças</a>, você pode solicitar que avaliemos se ela é uma licença livre. Por favor, envie um e-mail com uma cópia da licença (e a URL onde você a encontrou) para <a href="mailto:licensing@fsf.org">licensing@fsf.org</a>. A nossa equipe de especialistas em licenças e o conselho de administração vão revisá-la. Se a licença possui condições incomuns, elas podem representar problemas filosóficos difíceis, de forma que não podemos prometer uma decisão rápida.

source: Common Resources for our Software Licenses
pt_br: Recursos Comuns para nossas Licenças de Software

source: We have a number of resources to help people understand and use our various licenses:
pt_br: Nós temos uma gama de recursos para ajudar as pessoas a entender e usar nossas várias licenças:

source: <a href="/licenses/gpl-faq.html">Frequently Asked Questions about the GNU licenses</a>
pt_br: <a href="/licenses/gpl-faq.html">Questões Feitas Frequentemente sobre as licenças do GNU</a>

source: <a href="/licenses/gpl-howto.html">How to use GNU licenses for your own software</a>
pt_br: <a href="/licenses/gpl-howto.html">Como usar licenças GNU em seus próprios programas</a>

source: <a href="/licenses/gpl-violation.html">What to do if you see a violation of a GNU license</a>
pt_br: <a href="/licenses/gpl-violation.html">O que fazer caso você veja uma violação de uma licença GNU</a>

source: <a href="/licenses/license-compatibility.html">License Compatibility and Relicensing</a>
pt_br: <a href="/licenses/license-compatibility.html">Compatibilidade de licenças e relicenciamento</a>

source: <a href="/licenses/license-list.html">List of Free Software Licenses</a>
pt_br: <a href="/licenses/license-list.html">Lista de Licenças de Software Livre</a>

source: <a href="/philosophy/university.html">Releasing Free Software if you work at a university</a>
pt_br: <a href="/philosophy/university.html">Lance Software Livre caso você trabalhe em uma universidade</a>

source: <a href="/licenses/why-assign.html">Why the FSF gets copyright assignments from contributors</a>
pt_br: <a href="/licenses/why-assign.html">Por que a FSF detém o copyright dos contribuidores</a>

source: <a href="/graphics/license-logos.html">GNU license logos</a> to use with your project
pt_br: <a href="/graphics/license-logos.html">Logos das licenças GNU</a> para usar no seu projeto

source: <a href="http://www.fsf.org/licensing">The FSF Licensing &amp; Compliance Lab</a>
pt_br: <a href="http://www.fsf.org/licensing">O Laboratório de Licenciamento e Conformidade de Fundação do Software Livre</a>

source: <a href="/licenses/license-list.html#LicensingEmailAddress">&lt;licensing@fsf.org&gt;</a> for general licensing help
pt_br: <a href="/licenses/license-list.html#LicensingEmailAddress">&lt;licensing@fsf.org&gt;</a> para obter ajuda em geral sobre o uso de licenças

source: The GNU General Public License
pt_br: A Licença Pública Geral GNU

source: The GNU General Public License is often called the GNU GPL for short; it is used by most GNU programs, and by more than half of all free software packages. The latest version is version 3.
pt_br: A Licença Pública Geral GNU é frequentemente abreviada como GNU GPL e é utilizada pela maioria dos programas do GNU, assim como por mais da metade dos pacotes de software livre. A versão mais recente é versão 3.

source: The GNU General Public License is available in these formats: <a href="/licenses/gpl.html">HTML</a>, <a href="/licenses/gpl.txt">plain text</a>, <a href="/licenses/gpl.odt">ODF</a>, <a href="/licenses/gpl.dbk">Docbook</a>, <a href="/licenses/gpl.texi">Texinfo</a>, and <a href="/licenses/gpl.tex">LaTeX</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
pt_br: A Licença Pública Geral GNU está disponível nesses formatos: <a href="/licenses/gpl.html">HTML</a>, <a href="/licenses/gpl.txt">texto puro</a>, <a href="/licenses/gpl.odt">ODF</a>, <a href="/licenses/gpl.dbk">DocBook</a>, <a href="/licenses/gpl.texi">Texinfo</a> e <a href="/licenses/gpl.tex">LaTeX</a>. Esses documentos não estão formatados para publicação independente, com a intenção de ser incluídos em um outro documento.

source: <a href="/licenses/quick-guide-gplv3.html">A Quick Guide to GPLv3</a>
pt_br: <a href="/licenses/quick-guide-gplv3.html">Guia rápido da GPLv3</a>

source: <a href="/licenses/old-licenses/old-licenses.html#GPL">Older versions of the GNU GPL</a>
pt_br: <a href="/licenses/old-licenses/old-licenses.html#GPL">Versões mais antigas da GNU GPL</a>

source: The GNU Lesser General Public License
pt_br: A Licença Pública Geral Menor GNU

source: The GNU Lesser General Public License is used by a few (not by any means all) GNU libraries. The latest version is version 3.
pt_br: A Licença Pública Geral Menor GNU é utilizada em algumas (mas não todas) as bibliotecas do GNU. A versão mais recente é versão 3.

source: The GNU Lesser General Public License text is available in these formats: <a href="/licenses/lgpl.html">HTML</a>, <a href="/licenses/lgpl.txt">plain text</a>, <a href="/licenses/lgpl.dbk">Docbook</a>, and <a href="/licenses/lgpl.texi">Texinfo</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
pt_br: O texto da Licença Pública Geral Menor GNU está disponível nesses formatos: <a href="/licenses/lgpl.html">HTML</a>, <a href="/licenses/lgpl.txt">texto puro</a>, <a href="/licenses/lgpl.dbk">DocBook</a> e <a href="/licenses/lgpl.texi">Texinfo</a>. Esses documentos não estão formatados para publicação independente, com a intenção de ser incluídos em um outro documento.

source: <a href="/licenses/why-not-lgpl.html">Why you shouldn't use the Lesser GPL for your next library</a>
pt_br: <a href="/licenses/why-not-lgpl.html">Por que você não deveria utilizar a GPL Menor para a sua próxima biblioteca</a>

source: <a href="/licenses/old-licenses/old-licenses.html#LGPL">Older versions of the GNU LGPL</a>
pt_br: <a href="/licenses/old-licenses/old-licenses.html#LGPL">Versões mais antigas da GNU LGPL</a>

source: The GNU Affero General Public License
pt_br: A Licença Pública Geral Affero GNU

source: The GNU Affero General Public License is based on the GNU GPL, but has an additional term to allow users who interact with the licensed software over a network to receive the source for that program. We recommend that people consider using the GNU AGPL for any software which will commonly be run over a network. The latest version is version 3.
pt_br: A Licença Pública Geral Affero GNU é baseada na GNU GPL, com um termo adicional que permite usuários que interagem com o software licenciado sobre uma rede receber o fonte para aquele programa. Recomendamos que pessoas considerem usar a GNU AGPL para qualquer software que geralmente será executado por uma rede. A versão mais recente é versão 3.

source: The GNU Affero General Public License text is available in these formats: <a href="/licenses/agpl.html">HTML</a>, <a href="/licenses/agpl.txt">plain text</a>, <a href="/licenses/agpl.dbk">Docbook</a>, <a href="/licenses/agpl.texi">Texinfo</a>, and <a href="/licenses/agpl.tex">LaTeX</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
pt_br: O texto da Licença Pública Geral Affero GNU está disponível nesses formatos: <a href="/licenses/agpl.html">HTML</a>, <a href="/licenses/agpl.txt">texto puro</a>, <a href="/licenses/agpl.dbk">DocBook</a>, <a href="/licenses/agpl.texi">Texinfo</a> e <a href="/licenses/agpl.tex">LaTeX</a>. Esses documentos não estão formatados para publicação independente, com a intenção de ser incluídos em um outro documento.

source: <a href="/licenses/why-affero-gpl.html">Why the Affero GPL</a>
pt_br: <a href="/licenses/why-affero-gpl.html">Por que a GPL Affero</a>

source: The GNU Free Documentation License
pt_br: A Licença de Documentação Livre GNU

source: The GNU Free Documentation License is a form of copyleft intended for use on a manual, textbook or other document to assure everyone the effective freedom to copy and redistribute it, with or without modifications, either commercially or non-commercially. The latest version is 1.3.
pt_br: A Licença de Documentação Livre GNU é uma forma de copyleft criada para uso em manuais, livros texto ou outros documentos para garantir que qualquer um tem a real liberdade de copiar e redistribui-los, com ou sem modificações, tanto comercial quanto não-comercialmente. A versão mais recente é 1.3.

source: The GNU Free Documentation License text is available in these formats: <a href="/licenses/fdl.html">HTML</a>, <a href="/licenses/fdl.txt">plain text</a>, <a href="/licenses/fdl.xml">Docbook</a>, <a href="/licenses/fdl.texi">Texinfo</a>, and <a href="/licenses/fdl.tex">LaTeX</a>. These documents are not formatted for standalone publishing, and are intended to be included in another document.
pt_br: O texto da GNU Licença de Documentação Livre está disponível nesses formatos: <a href="/licenses/fdl.html">HTML</a>, <a href="/licenses/fdl.txt">texto puro</a>, <a href="/licenses/fdl.dbk">DocBook</a>, <a href="/licenses/fdl.texi">Texinfo</a> e <a href="/licenses/fdl.tex">TeX</a>. Esses documentos não estão formatados para publicação independente, com a intenção de ser incluídos em um outro documento.

source: <a href="/licenses/why-gfdl.html">Why publishers should use the GNU FDL</a>
pt_br: <a href="/licenses/why-gfdl.html">Por que os editores devem utilizar a GNU FDL</a>

source: <a href="/licenses/fdl.html#addendum">How to use the GNU FDL for your documentation</a>
pt_br: <a href="/licenses/fdl.html#addendum">Como usar a GNU FDL para sua documentação</a>

source: <a href="/licenses/fdl-howto.html">Tips on using the GNU FDL</a>
pt_br: <a href="/licenses/fdl-howto.html">Dicas de como usar a GNU FDL</a>

source: <a href="/licenses/fdl-howto-opt.html">How to use the optional features of the GNU FDL</a>
pt_br: <a href="/licenses/fdl-howto-opt.html">Como usar os recursos opcionais da GNU FDL</a>

source: <a href="/licenses/old-licenses/old-licenses.html#FDL"> Older versions of the GNU FDL</a>
pt_br: <a href="/licenses/old-licenses/old-licenses.html#FDL"> Versões mais antigas da GNU FDL</a>

source: Exceptions to GNU Licenses
pt_br: Exceções às Licenças GNU

source: Some GNU programs have additional permissions or special exceptions to specific terms in one of the main licenses. Since some of those are commonly used or inspire a lot of questions on their own, we've started collecting them on our <a href="/licenses/exceptions.html">exceptions page</a>.
pt_br: Alguns programas do GNU possuem permissões adicionais ou exceções especiais para termos específicos em uma das principais licenças. Considerando que alguns destes são usados normalmente ou resultam em muitas perguntas, começamos a coletá-los em nossa <a href="/licenses/exceptions.html">página de exceções</a>.

source: License URLs
pt_br: URLs das licenças

source: When linking to our licenses, it's usually best to link to the latest version; hence the standard URLs such as <tt>http://www.gnu.org/licenses/gpl.html</tt> have no version number. Occasionally, however, you may want to link to a specific version of a given license. In those situations, you can use the following links [<a href="#urlskip">skip links</a>]:
pt_br: Ao fornecer link para nossas licenças, geralmente o melhor é fazê-lo para a versão mais recente; por este motivo, as URLs padrões como <tt>http://www.gnu.org/licenses/gpl.html</tt> não possuem número de versão. Ocasionalmente, porém, você pode preferir fornecer o link para uma versão específica de uma dada licença. Nestas situações, você pode usar os seguintes links [<a href="#urlskip">pular os links</a>]:

source: GNU General Public License (GPL)
pt_br: Licença Pública Geral GNU (GPL)

source: GNU Lesser General Public License (LGPL)
pt_br: Licença Pública Geral Menor GNU (LGPL)

source: GNU Affero General Public License (AGPL)
pt_br: Licença Pública Geral Affero GNU (AGPL)

source: <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU AGPLv3</a> (The <a href="http://www.affero.org/oagpl.html">Affero General Public License version 1</a> is not a GNU license, but it was designed to serve a purpose much like the GNU AGPL's.)
pt_br: <a href="http://www.gnu.org/licenses/agpl-3.0.html">GNU AGPLv3</a> (A <a href="http://www.affero.org/oagpl.html">Licença Pública Geral Affero versão 1</a> não é uma licença GNU, mas ela foi elaborada para servir a um propósito muito parecido ao da GNU AGPL.)

source: GNU Free Documentation License (FDL)
pt_br: Licença de Documentação Livre GNU (FDL)

source: <a name="urlskip"></a>Stable links to each license's alternative formats are available on its respective page. Not every version of every license is available in every format. If you need one that is missing, please <a href="mailto:licensing@gnu.org">email us</a>.
pt_br: <a name="urlskip"></a>Links estáveis os formatos alternativos de cada licença estão disponíveis em suas respectivas páginas. Nem toda versão de cada licença está disponível em todo formato. Se você precisar de um que esteja faltando, por favor <a href="mailto:licensing@gnu.org">nos envie um e-mail</a>.

source: See also the <a href="old-licenses/">old licenses page</a>.
pt_br: Veja também a <a href="old-licenses/">página de antigas licenças</a>.

source: Unofficial Translations
pt_br: Traduções Extra-Oficiais

source: Legally speaking, the original (English) version of the licenses is what specifies the actual distribution terms for GNU programs and others that use them. But to help people better understand the licenses, we give permission to publish translations into other languages provided that they follow our regulations for unofficial translations:
pt_br: Em termos legais, a versão original em inglês das licenças é o que especifica os verdadeiros termos de distribuição para os programas do GNU e outros que usam-os. Mas para ajudar as pessoas a entender melhor as licenças, nós damos permissão para publicar traduções em outros idiomas se as traduções seguirem as nossas regras para traduções extra-oficiais:

source: <a href="/licenses/translations.html">List of unofficial translations</a>
pt_br: <a href="/licenses/translations.html">Lista de traduções extra-oficiais</a>

source: <a href="/licenses/translations.html#rules">How to create an unofficial translation</a>
pt_br: <a href="/licenses/translations.html#rules">Como criar uma tradução extra-oficial</a>

source: Verbatim Copying and Distribution
pt_br: Cópias Exatas e Distribuição

source: The standard copyright terms for GNU web pages is now the <a href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>. It used to be (and for a few pages still is):
pt_br: Os termos padrões de copyright para as páginas do site do GNU estão licenciados sob a licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.pt_BR">Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a>. Ela costumava ser (e ainda é para algumas poucas páginas):

source: Verbatim copying and distribution of this entire article are permitted worldwide, without royalty, in any medium, provided this notice is preserved.
pt_br: A cópia fiel e a distribuição deste artigo completo é permitida em qualquer meio, desde que esta nota seja preservada.

source: Please note the following commentary about this &ldquo;verbatim license&rdquo; by Eben Moglen:
pt_br: Por favor note o seguinte comentário sobre esta “licença exata” por Eben Moglen:

source: &ldquo;Our intention in using the phrase &lsquo;verbatim copying in any medium&rsquo; is not to require retention of page headings and footers or other formatting features. Retention of weblinks in both hyperlinked and non-hyperlinked media (as notes or some other form of printed URL in non-HTML media) is required.&rdquo;
pt_br: “Nossa intenção em usar a expressão 'cópia exata em qualquer meio' não é exigir a retenção dos cabeçalhos e rodapés das páginas ou outro recurso de formatação. A retenção de links em mídias com ou sem hiperlink (como notas ou outras formas de URL impressas em mídia não-HTML) é exigida.”

source: List of Free Software Licenses
pt_br: Lista de Licenças de Software Livre

source: If you are contemplating writing a new license, please contact the FSF by writing to <a href="mailto:licensing@fsf.org">&lt;licensing@fsf.org&gt;</a>. The proliferation of different free software licenses means increased work for users in understanding the licenses; we may be able to help you find an existing Free Software license that meets your needs.
pt_br: Se você está considerando escrever uma nova licença, por favor entre em contato com a FSF no endereço <a href="mailto:licensing@fsf.org">&lt;licensing@fsf.org&gt;</a>. A proliferação de diferentes licenças de software livre significa mais trabalho para os usuários entenderem essas licenças; nós podemos ser capazes de ajudá-lo a encontrar uma licença de software livre existente que atenda às suas necessidades.

source: If that isn't possible, if you really need a new license, with our help you can ensure that the license really is a Free Software license and avoid various practical problems.
pt_br: Se isto não for possível, se você realmente precisa de uma nova licença, com nossa ajuda você pode ter certeza que a licença realmente será uma licença de software livre e evitar vários problemas práticos.

source: What Is Copyleft?
pt_br: O Que É Copyleft?

source: <a href="/copyleft/copyleft.html"><em>Copyleft</em></a> is a general method for making a program free software and requiring all modified and extended versions of the program to be free software as well.
pt_br: <a href="/copyleft/copyleft.html"><em>Copyleft</em></a> é um método legal de tornar um programa em software livre e exigir que todas as versões modificadas e estendidas do programa também sejam software livre.
