Repository: gitGNU/gnu_www-pt-br
Catalog: licenses/licenses.*.po
Languages: pt_br

source: The simplest way to make a program free is to put it in the <a href="/philosophy/categories.html#PublicDomainSoftware">public domain</a>, uncopyrighted. This allows people to share the program and their improvements, if they are so minded. But it also allows uncooperative people to convert the program into <a href="/philosophy/categories.html#ProprietarySoftware">proprietary software</a>. They can make changes, many or few, and distribute the result as a proprietary product. People who receive the program in that modified form do not have the freedom that the original author gave them; the middleman has stripped it away.
pt_br: O modo mais simples de tornar um programa livre é colocá-lo sob o <a href="/philosophy/categories.html#PublicDomainSoftware">domínio público</a>, sem copyright. Isto permite que as pessoas compartilhem o programa e suas melhorias, se elas assim o desejarem. Mas isto também permite a pessoas não-cooperativas converterem o programa em <a href="/philosophy/categories.html#ProprietarySoftware">software proprietário</a>. Elas podem fazer modificações, muitas ou poucas, e distribuir o resultado como um produto proprietário. As pessoas que recebem o programa nesta versão modificada não tem as liberdades que o autor original deu a elas; o intermediário as retirou.

source: In the <a href="/gnu/thegnuproject.html">GNU project</a>, our aim is to give <em>all</em> users the freedom to redistribute and change GNU software. If middlemen could strip off the freedom, we might have many users, but those users would not have freedom. So instead of putting GNU software in the public domain, we &ldquo;copyleft&rdquo; it. Copyleft says that anyone who redistributes the software, with or without changes, must pass along the freedom to further copy and change it. Copyleft guarantees that every user has freedom.
pt_br: No <a href="/gnu/thegnuproject.html">Projeto GNU</a>, nosso intento é dar a <em>todos</em> os usuários a liberdade de redistribuir e modificar o software GNU. Se intermediários pudessem retirar as liberdades, nós poderíamos ter muitos usuários, mas não teríamos liberdade. Por isso, em vez de colocar o GNU em domínio público, nós o tornamos “copyleft”. Copyleft diz que qualquer um que redistribui o software, com ou sem modificações, tem que passar adiante as liberdades de fazer novas cópias e modifica-las. O Copyleft garante que todos os usuários tenham liberdade.

source: Copyleft also provides an <a href="/philosophy/pragmatic.html">incentive</a> for other programmers to add to free software. Important free programs such as the GNU C++ compiler exist only because of this.
pt_br: Copyleft também fornece um <a href="/philosophy/pragmatic.html">incentivo</a> para outros programadores adicionarem recursos ao software livre. Programas livres importantes como o compilador GNU C++ só existem por causa disso.

source: Copyleft also helps programmers who want to contribute <a href="/software/software.html#develop">improvements</a> to <a href="/philosophy/free-sw.html">free software</a> get permission to do that. These programmers often work for companies or universities that would do almost anything to get more money. A programmer may want to contribute her changes to the community, but her employer may want to turn the changes into a proprietary software product.
pt_br: O Copyleft também ajuda os programadores que desejam contribuir com <a href="/software/software.html#develop">melhorias</a> para o <a href="/philosophy/free-sw.html">software livre</a> a obterem permissão de fazê-lo. Esses programadores frequentemente trabalham para empresas ou universidades que fariam qualquer coisa para ganhar mais dinheiro. Um programador pode desejar contribuir com modificações para a comunidade, mas seu empregador pode desejar transformar as mudanças em um produto de software proprietário.

source: When we explain to the employer that it is illegal to distribute the improved version except as free software, the employer usually decides to release it as free software rather than throw it away.
pt_br: Quando nós explicamos ao empregador que é ilegal distribuir a versão melhorada exceto como software livre, o empregador geralmente decide liberá-la como software livre em vez de descartá-la.

source: To copyleft a program, we first state that it is copyrighted; then we add distribution terms, which are a legal instrument that gives everyone the rights to use, modify, and redistribute the program's code <em>or any program derived from it</em> but only if the distribution terms are unchanged. Thus, the code and the freedoms become legally inseparable.
pt_br: Para tornar um programa em copyleft, nós primeiro afirmamos que ele está sob copyright; então, nós adicionamos termos de distribuição, que são um instrumento legal que concede a todos o direito de usar, modificar, e redistribuir o código-fonte do programa <em>ou qualquer outro programa derivado dele</em>, mas somente se os termos de distribuição permanecerem inalterados. Assim, o código e as liberdades se tornam legalmente inseparáveis.

source: Proprietary software developers use copyright to take away the users' freedom; we use copyright to guarantee their freedom. That's why we reverse the name, changing &ldquo;copyright&rdquo; into &ldquo;copyleft&rdquo;.
pt_br: Desenvolvedores de software proprietário utilizam o copyright para retirar as liberdades das pessoas; nós utilizamos o copyright para garantir essas liberdades. É por isso que nós invertemos o nome, mudando “copyright” (“direitos de cópia”, “cópia direita”) para “copyleft” (“deixamos copiar”, “cópia esquerda”).

source: Copyleft is a general concept; there are many ways to fill in the details. In the GNU Project, the specific distribution terms that we use are contained in the GNU General Public License, the GNU Lesser General Public License and the GNU Free Documentation License.
pt_br: O Copyleft é um conceito genérico; existem vários modos de preencher os detalhes. No Projeto GNU, os termos específicos de distribuição que nós utilizamos estão contidos na Licença Pública Geral GNU, na Licença Pública Menos Geral e na Licença de Documentação Livre.

source: The appropriate license is included in many manuals and in each GNU source code distribution.
pt_br: A licença apropriada é incluída em vários manuais e em cada distribuição de código-fonte do GNU.

source: The GNU GPL is designed so that you can easily apply it to your own program if you are the copyright holder. You don't have to modify the GNU GPL to do this, just add notices to your program which refer properly to the GNU GPL. Please note that you must use the entire text of the GPL, if you use it. It is an integral whole, and partial copies are not permitted. (Likewise for the LGPL, AGPL, and FDL.)
pt_br: A GNU GPL foi desenhada de modo que ela seja facilmente aplicável ao seu próprio programa se você é o detentor do copyright. Você não tem que modificar a GNU GPL para fazer isso, apenas adicione notas ao seu programa que se refiram adequadamente à GPL. Por favor note que você deve utilizar o texto completo da GPL, se você utilizá-la. Ele é um conjunto indivisível, e cópias parciais não são permitidas. (O mesmo vale para a LGPL, AGPL e FDL.)

source: Using the same distribution terms for many different programs makes it easy to copy code between various different programs. Since they all have the same distribution terms, there is no need to think about whether the terms are compatible. The Lesser GPL includes a provision that lets you alter the distribution terms to the ordinary GPL, so that you can copy code into another program covered by the GPL.
pt_br: Utilizar os mesmos termos de distribuição para vários programas diferentes torna mais fácil copiar código entre eles. Já que eles têm os mesmos termos de distribuição, não há necessidade de verificar se os termos são compatíveis. A LGPL inclui um termos que deixa você alterar os termos de distribuição para a GPL original, de modo que você possa copiar código de um programa LGPL para um programa coberto pela GPL.

source: Licenses for Other Types of Works
pt_br: Licenças para Outros Tipos de Obras

source: We believe that published software and documentation should be <a href="/philosophy/free-doc.html">free software and free documentation</a>. We recommend making all sorts of educational and reference works free also, using free documentation licenses such as the <a href="#FDL">GNU Free Documentation License</a> (GNU FDL).
pt_br: Nós acreditamentos que software e documentação publicados devam ser <a href="/philosophy/free-doc.html">software livre e documentação livre</a>. Recomendamos fazer todo tipo de trabalho educacional e referencial livre também, usando licenças de documentação livre, tais como a <a href="#FDL">Licença de Documentação Livre GNU</a> (GNU FDL).

source: For essays of opinion and scientific papers, we recommend either the <a href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>, or the simple &ldquo;verbatim copying only&rdquo; license stated above.
pt_br: Para textos de opinião ou artigos científicos, recomendamos a <a href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.pt_BR">Licença Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a> ou a licença simples de “cópia exata apenas” supramencionada.

source: We don't take the position that artistic or entertainment works must be free, but if you want to make one free, we recommend the <a href="//directory.fsf.org/wiki/License:Free-Art-L-v1.3">Free Art License</a>.
pt_br: Não tomamos partido sobre a obras artísticas ou de entretenimento deverem ser livres, mas se você desejar fazer uma livre, recomendamos a <a href="//directory.fsf.org/wiki/License:Free-Art-L-v1.3">Licença de Arte Livre</a>.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
pt_br: Esta página está licenciada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.pt_BR">Creative Commons Atribuição-SemDerivações 4.0 Internacional</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: Traduzido por: Fernando Lozano <a href="mailto:fernando@lozano.eti.br">&lt;fernando@lozano.eti.br&gt;</a> e Rafael Fontenelle <a href="mailto:rafaeff@gnome.org">&lt;rafaelff@gnome.org&gt;</a>

source: Updated:
pt_br: Última atualização:
