Repository: gitGNU/gnu_www-pt-br
Catalog: music/free-software-song.*.po
Languages: pt_br

source: The Free Software Song - GNU Project - Free Software Foundation
pt_br: A Música do Software Livre - Projeto GNU - Free Software Foundation

source: The Free Software Song
pt_br: A Música do Software Livre

source: by Richard Stallman
pt_br: por <strong>Richard Stallman</strong>

source: You can read the story of <a href="/music/writing-fs-song.html">the writing of the song</a>, too.
pt_br: Você pode ler a história da <a href="/music/writing-fs-song.html">escrita da música</a>, também.

source: The lyrics of the &ldquo;Free Software Song&rdquo; are sung to the melody of the Bulgarian folk song &ldquo;<a href="#SadiMoma" id="REFSadiMoma">Sadi moma bela loza</a>&rdquo;
pt_br: As letras da “Música do Software Livre” são cantadas na melodia da música popular búlgara “<a href="#SadiMoma" id="REFSadiMoma">Sadi moma bela loza</a>”

source: Join us now and share the software;
pt_br: Juntem-se a nós e partilhem o software;

source: You'll be free, <a href="http://stallman.org/articles/on-hacking.html">hackers</a>, you'll be free.
pt_br: Serão livres, <a href="http://stallman.org/articles/on-hacking.html">hackers</a>, serão livres.

source: You'll be free, hackers, you'll be free.
pt_br: Serão livres, hackers, serão livres.

source: Hoarders can get piles of money,
pt_br: Acumuladores podem obter pilhas de dinheiro,

source: That is true, hackers, that is true.
pt_br: Isso é verdade, hackers, isso é verdade.

source: But they cannot help their neighbors;
pt_br: Mas eles não conseguem ajudar os seus vizinhos;

source: That's not good, hackers, that's not good.
pt_br: Isso não é bom, hackers, isso não é bom.

source: When we have enough free software
pt_br: Quando tivermos software livre suficiente

source: At our call, hackers, at our call,
pt_br: À nossa disposição, hackers, à nossa disposição,

source: We'll kick out those dirty licenses
pt_br: Pontapearemos essas licenças sujas

source: Ever more, hackers, ever more.
pt_br: Cada vez mais, hackers, cada vez mais.

source: This song is in a rhythm of 7/8; those unaccustomed to odd rhythms often take the unevenness to be a mistake. The meter can be analyzed into three subgroups as slow-quick-quick or 3-2-2. Such meters in Bulgarian music can often be stretched, and some musicians analyze this song as 3-2-3 instead; however, Yves Moreau, who collected and taught the dance, endorses the rhythm of 7.
pt_br: Essa música está em um ritmo de 7/8; aqueles desacostumados a ritmos estranhos geralmente consideram essa irregularidade como um erro. A métrica pode ser analisada em três subgrupos como lento-rápido-rápido ou 3-2-2. Tais métricas na música búlgara geralmente podem ser esticadas, e alguns músicos analisam essa música como 3-2-3; porém, Yves Moreau, que colecionou e ensinou a dança, aprova o ritmo de 7.

source: A <a href="/music/free-software-song.au">recording (.au format)</a> of <a href="http://www.stallman.org/">Richard Stallman</a> singing this song, also available in <a href="/music/free-software-song.ogg">Ogg Vorbis format</a>.
pt_br: Uma <a href="/music/free-software-song.au">gravação (formato .au)</a> do <a href="http://www.stallman.org/">Richard Stallman</a> cantando essa música, também disponível no <a href="/music/free-software-song.ogg">formato Ogg Vorbis</a>.

source: A <a href="/music/FreeSWSong.ogg">recording (.ogg)</a> of the piece accompanied by Bulgarian instruments played in traditional style.
pt_br: Uma <a href="/music/FreeSWSong.ogg">gravação (.ogg)</a> da peça acompanhada pelos instrumentos tocados no estilo tradicional.

source: A <a href="http://audio-video.gnu.org/video/stallman_free_software_song_320x240.ogv">video of RMS performing the song (ogg)</a>, released under GFDLv1.3+ by the videographer, Julian Coccia.
pt_br: Um <a href="http://audio-video.gnu.org/video/stallman_free_software_song_320x240.ogv">vídeo do RMS cantando a música (ogg)</a>, lançada sob GFDLv1.3+ pelo cinegrafista, Julian Coccia.

source: A <a href="/music/free-software-song-herzog.ogg">recording (.ogg)</a> of Katie Herzog performing the Free Software Song, released under <a href="http://creativecommons.org/licenses/by-nc-nd/3.0/">CC BY-NC-ND</a>.
pt_br: Uma <a href="/music/free-software-song-herzog.ogg">gravação (.ogg)</a> de Katie Herzog cantando a Música do Software Livre, lançada sob <a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.pt_BR">CC BY-NC-ND</a>.

source: Alternate versions
pt_br: Versões alternativas

source: <a href="http://audio-video.gnu.org/audio/Fenster-Free-Software-Song.ogg">Another song</a>, inspired by this one but mostly different, sung by the band Fenster (4.5M).
pt_br: <a href="http://audio-video.gnu.org/audio/Fenster-Free-Software-Song.ogg">Uma outra música</a>, inspirada por esta, mas muito diferente, cantada pela banda Fenster (4,5 MB).

source: A rhythmic version of free software song in <a href="/music/free-software-song-rhythmic.ogg">Ogg Vorbis</a> format by Thor.
pt_br: Uma versão rítmica da música do software livre no formato <a href="/music/free-software-song-rhythmic.ogg">Ogg Vorbis</a> por Thor.

source: An improvised piano version by Markus Haist in <a href="/music/markushaist-free-software-song.ogg">Ogg Vorbis</a> format (1.2 MB), released under <a href="/licenses/gpl-3.0.html">GPLv3</a>.
pt_br: Uma versão improvisada no piano por Markus Haist no formato <a href="/music/markushaist-free-software-song.ogg">Ogg Vorbis</a> (1,2 MB), lançada sob <a href="/licenses/gpl-3.0.html">GPLv3</a>.

source: Another rock-like version by Pjj &amp; Hairyone in <a href="/music/pjj-and-hairyone-freesoftwaresong.ogg">Ogg Vorbis</a> format (1.6 MB).
pt_br: Uma outra versão tipo rock por Pjj &amp; Hairyone no formato <a href="/music/pjj-and-hairyone-freesoftwaresong.ogg">Ogg Vorbis</a> (1.6 MB).

source: A Spanish punk variant by ALEC in <a href="http://www.pc-freak.net/files/free-software-songs/Free_Software_Song_en_espa%c3%b1ol.ogv">Ogg Vorbis</a> format (1.7 MB).
pt_br: Uma variação punk em espanhol por ALEC no formato <a href="http://www.pc-freak.net/files/free-software-songs/Free_Software_Song_en_espa%c3%b1ol.ogv">Ogg Vorbis</a> (1,7 MB).

source: A version with a different structure in <a href="/music/freesoft.ogg"> Ogg Vorbis</a> format (3.7 MB) by Robert Kay, released under <a href="http://creativecommons.org/licenses/by-nc-sa/3.0/legalcode">CC-BY-NC-SA</a>.
pt_br: Uma versão com uma estrutura diferente no formato <a href="/music/freesoft.ogg">Ogg Vorbis</a> (3,7 MB) por Robert Kay, lançada sob <a href="http://creativecommons.org/licenses/by-nc-sa/3.0/legalcode">CC-BY-NC-SA</a>.

source: A version by the band Zweitgolf: <a href="free_software_song_sunnata.ogg">free_software_song_sunnata.ogg</a>, released under the GPL
pt_br: Uma versão da banda Zweitgolf: <a href="free_software_song_sunnata.ogg">free_software_song_sunnata.ogg</a>, lançada sob a GPL.

source: Here is a metal version by Jono Bacon in <a href="http://www.pc-freak.net/files/free-software-songs/jonobacon-freesoftwaresong2.ogg">Ogg Vorbis</a> format (3.9 MB), released under <a href="http://creativecommons.org/licenses/by-sa/2.0/"> CC BY-SA</a>.
pt_br: Aqui está uma versão metal por Jono Bacon no formato <a href="http://www.pc-freak.net/files/free-software-songs/jonobacon-freesoftwaresong2.ogg">Ogg Vorbis</a> (3,9 MB), lançado sob <a href="http://creativecommons.org/licenses/by-sa/2.0/">CC BY-SA</a>.

source: This rock/metal version is put out by <a href="http://freesoftwaresong.altervista.org/"> Loneload</a> available in <a href="/music/loneload-free-software-song.ogg">Ogg Vorbis</a> format (2.2 MB), released under <a href="http://creativecommons.org/licenses/by/3.0/">CC BY</a>.
pt_br: Essa versão rock/metal foi criada por <a href="http://freesoftwaresong.altervista.org/">Loneload</a> no formato <a href="/music/loneload-free-software-song.ogg">Ogg Vorbis</a> (2,2 MB), lançado sob <a href="http://creativecommons.org/licenses/by/3.0/">CC BY</a>.

source: <a href="http://archive.org/details/M00GNU">MooGNU</a> by the anonymous posters on the 4chan technology image board /g/ is licensed under the <a href="http://creativecommons.org/licenses/by-sa/3.0/legalcode">Creative Commons Attribution-ShareAlike 3.0 Unported License</a>. Available in <a href="http://archive.org/download/M00GNU/Freedom-catmoognu.ogv"> Ogg Video</a> format (4.5 MB).
pt_br: <a href="http://archive.org/details/M00GNU">MooGNU</a>, de publicadores anônimos no quadro de imagem tecnológica /g/ do 4chan, está licenciado sob a licença <a href="http://creativecommons.org/licenses/by-sa/3.0/legalcode">Creative Commons Atribuição-CompartilhaIgual 3.0 Não Adaptada</a>. Disponível no formato <a href="http://archive.org/download/M00GNU/Freedom-catmoognu.ogv">Ogg Vídeo</a> (4,5 MB).

source: The band <a href="http://sebkhachott.net/spip/?Free-Software-Song">Sebkha-Chott</a> released in 2012, a <em>matricide</em> of the Free Software Song to celebrate the death of <a href="http://www.laquadrature.net/en/ACTA">ACTA</a>. It's available in <a href="http://archive.org/download/Sebkha-Chott_FSFSongIsHip_2012/SC_FSF.ogg">Ogg vorbis</a> (2.3MB), or in <a href="http://archive.org/download/Sebkha-Chott_FSFSongIsHip_2012/SC_FSF.flac">FLAC</a> (10.1MB), under the <a href="//directory.fsf.org/wiki/License:Free-Art-L-v1.3">Free Art License, version 1.3</a>.
pt_br: A banda <a href="http://sebkhachott.net/spip/?Free-Software-Song">Sebkha-Chott</a> lançou, em 2012, um <em>matricida</em> da Música do Software Livre para celebrar a morte da <a href="http://www.laquadrature.net/en/ACTA">ACTA</a>. Está disponível em <a href="http://archive.org/download/Sebkha-Chott_FSFSongIsHip_2012/SC_FSF.ogg">Ogg Vorbis</a> (2,3 MB) ou em <a href="http://archive.org/download/Sebkha-Chott_FSFSongIsHip_2012/SC_FSF.flac">FLAC</a> (10,1 MB), sob a <a href="//directory.fsf.org/wiki/License:Free-Art-L-v1.3">Licença de Arte Livre, versão 1.3</a>.

source: The <strong>ecantorix</strong> program, a singing synthesis frontend for espeak, released under the GPLv3+, features the <a href="http://cloud.github.com/downloads/divVerent/ecantorix/song.ogg">Free Software Song as an example output</a>.
pt_br: O programa <strong>ecantorix</strong>, um frontend de síntese de canto para espeak, lançado sob a GPLv3+, fornecendo a <a href="http://cloud.github.com/downloads/divVerent/ecantorix/song.ogg">Música de Software Livre como uma saída de exemplo</a>.

source: <a href="https://commons.wikimedia.org/wiki/File%3AFreesoftwaresong_126_mix.ogg"> Yet another version from Wikimedia Commons</a> (967 KB) is licensed under CC0.
pt_br: <a href="https://commons.wikimedia.org/wiki/File%3AFreesoftwaresong_126_mix.ogg">Mais uma versão do Wikimedia Commons</a> (967 KB) está licenciada sob CC0.

source: You can get a <a href="/music/free-software-song.pdf">typeset score</a> of the song made with <a href="http://lilypond.org">GNU LilyPond</a>. The LilyPond <a href="/music/free-software-song.ly">source</a> for the typeset score is also available.
pt_br: Você pode obter uma <a href="/music/free-software-song.pdf">formatação da partitura</a> da música feita com <a href="http://lilypond.org">GNU LilyPond</a>. O <a href="/music/free-software-song.ly">fonte</a> da formatação da partitura, feita no LilyPond, também está disponível.

source: Natty Traywick has <a href="https://musescore.com/user/1102686/scores/2429346">typeset it with MuseScore</a>, the &ldquo;other&rdquo; free scorewriter.
pt_br: Natty Traywick <a href="https://musescore.com/user/1102686/scores/2429346">formatou-a com MuseScore</a>, um “outro” escritor de partitura livre.

source: &ldquo;Sadi moma bela loza&rdquo;
pt_br: “Sadi moma bela loza”

source: Here is a description of the tune of &ldquo;Sadi moma bela loza,&rdquo; a Bulgarian dance tune, in an ad-hoc form of notation using letters for notes. A dash means the previous note continues. There are seven beats per measure, thus seven characters in each group.
pt_br: Aqui está uma descrição do tom da “Sadi moma bela loza”, um tom de dança búlgara, em uma forma ad-hoc de notação usando letras para tons. Um traço significa a continuação da nota anterior. Há sete batidas por medida, então sete caracteres em cada grupo.

source: It is also available as an <a href="/music/sadi-moma.abc">ABC file</a>.
pt_br: Também está disponível como um <a href="/music/sadi-moma.abc">arquivo ABC</a>.

source: Licensing
pt_br: Licenciamento

source: Richard Stallman and the Free Software Foundation claim no copyright on this song.
pt_br: Richard Stallman e a Free Software Foundation reivindica nenhum copyright sobre esta música.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/">Creative Commons Attribution-NoDerivatives 4.0 International License</a>.
pt_br: Esta página está licenciada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/4.0/deed.pt_BR">Creative Commons Atribuição-SemDerivações 4.0 Internacional</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: <b>Tradução:</b> Rafael Fontenelle <a href="mailto:rafaelff@gnome.org">&lt;rafaelff@gnome.org&gt;</a>, 2016

source: Updated:
pt_br: Última atualização:
