Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/fighting-software-patents.*.po
Languages: pt_br

source: Fighting Software Patents - Singly and Together - GNU Project - Free Software Foundation
pt_br: Combatento Patentes de Sofware - Uma a uma e Todas Juntas - Projeto GNU - Free Software Foundation

source: Fighting Software Patents - Singly and Together
pt_br: Combatento Patentes de Sofware - Uma a uma e Todas Juntas

source: by Richard Stallman
pt_br: Por Richard Stallman

source: Software patents are the software project equivalent of land mines: each design decision carries a risk of stepping on a patent, which can destroy your project.
pt_br: Patentes de sofware são equivalentes a minas terrestres num projeto de software: cada decisão sobre o visual carrega o risco de pisar numa patente, que pode destruir o seu projeto.

source: Developing a large and complex program means combining many ideas, often hundreds or thousands of them. In a country that allows software patents, chances are that some substantial fraction of the ideas in your program will be patented already by various companies. Perhaps hundreds of patents will cover parts of your program. A study in 2004 found almost 300 US patents that covered various parts of a single important program. It is so much work to do such a study that only one has been done.
pt_br: Desenvolver um programa grande e complexo significa combinar várias idéias, quase sempre centenas ou milhares delas. Num país que permite patentes de software, as chances são de que alguma fração substancial das idéias no seu programa já vão estar patenteadas por várias companhias. Talvez centenas de patentes vão cobrir partes do seu programa. Um estudo feito em 2004 encontrou quase 300 patentes americanas que cobriam várias partes de um único prorgama importante. É tão trabalhoso realizar tal estudo que apenas um foi feito até agora.

source: Practically speaking, if you are a software developer, you will usually be threatened by one patent at a time. When this happens, you may be able to escape unscathed if you find legal grounds to overturn the patent. You may as well try it; if you succeed, that will mean one less mine in the mine field. If this patent is particularly threatening to the public, the <a href="http://www.pubpat.org">Public Patent Foundation (pubpat.org)</a> may take up the case; that is its specialty. If you ask for the computer-using community's help in searching for prior publication of the same idea, to use as evidence to overturn a patent, we should all respond with whatever useful information we might have.
pt_br: Em termos práticos, se você é um desenvolvedor de software, você vai normalmente ser ameaçado por uma patente algumas vezes. Quando isso acontece, você pode sair ileso se você encontrar chão legal para derrubar a patente. Você pode tentá-lo; se você tiver sucesso, isso vai significar uma mina a menos no campo minado. Se essa patente for particularmente ameaçadora para o público, a <a href="http://www.pubpat.org">Fundação pelas Patentes Públicas (pubpat.org)</a> pode se interessar pelo caso; essa é a sua especialidade. Se você pedir ajuda para a comunidade usuária de computadores para procurar por uma publicação prévia da mesma idéia, para utilizar como prova para derrubar a patente, nós todos deveriamos responder com qualquer informação útil que nós podemos ter.

source: However, fighting patents one by one will never eliminate the danger of software patents, any more than swatting mosquitos will eliminate malaria. You cannot expect to defeat every patent that comes at you, any more than you can expect to kill every monster in a video game: sooner or later, one is going to defeat you and damage your program. The US patent office issues around a hundred thousand software patents each year; our best efforts could never clear these mines as fast as they plant more.
pt_br: No entanto, combater patentes uma por uma nunca vai eliminar o perigo das patentes de software, da mesmo forma que esmagar mosquitos nunca vai eliminar a malária. Você não pode esperar que pode derrotar todas as patentes que ameaçam você, mais do que você pode esperar matar cada monstro em um jogo de video game: mais cedo ou mais tarde, alguma vai derrotar você e danificar o seu programa. O escritório de patentes dos Estados Unidos emide cerca de cem mil patentes de software por ano; nossos melhores esforços nun conseguiram eliminar essas minas tão rápido quanto eles instalam mais.

source: Some of these mines are impossible to clear. Every software patent is harmful, and every software patent unjustly restricts how you use your computer, but not every software patent is legally invalid according to the patent system's criteria. The software patents we can overturn are those that result from &ldquo;mistakes&rdquo;, where the patent system's rules were not properly carried out. There is nothing we can do when the only relevant mistake was the policy of allowing software patents.
pt_br: Algumas destas minas são impossíveis de se eliminar. Cada patente de software é danosa, e cada patente de software restringe você injustamente de como usar o seu computador, mas nem toda a patente de software é legalmente inválida de acordo com os critérios do sistema de patentes. As patentes de software que nós podemos derrubar são aquelas que resultam de “erros”, onde as regras do sistema de patentes não foram apropriadamente obedecidas. Não há nada que nós possamos fazer quando o único erro relevante foi a política de permitir patentes de software.

source: To make a part of the castle safe, you've got to do more than kill the monsters as they appear&mdash;you have to wipe out the generator that produces them. Overturning existing patents one by one will not make programming safe. To do that, we have to change the patent system so that patents can no longer threaten software developers and users.
pt_br: Para tornar parte do castelo segura, você deve fazer mais do que matar os monstros a medida que eles vão aparecendo — você deve eliminar o gerador que os produz. Derrubar patentes existentes uma por uma não vai tornar a programação segura. Para fazê-lo, nós devemos modificar o sistema de patentes de maneira que as patentes não possam mais ameaçar desenvolvedores de software e usuários.

source: There is no conflict between these two campaigns: we can work on the short-term escape and the long-term fix at once. If we take care, we can make our efforts to overturn individual software patents do double duty, building support for efforts to correct the whole problem. The crucial point is not to equate &ldquo;bad&rdquo; software patents with mistaken or invalid software patents. Each time we invalidate one software patent, each time we talk about our plans to try, we should say in no uncertain terms, &ldquo;One less software patent, one less menace to programmers: the target is zero.&rdquo;
pt_br: Não existe conflito entre essas duas campanhas: nós podemos trabalhar na saída a curto prazo e no reparo a longo prazo de uma vez só. Se nós tomarmos cuidado, nós nós podemos fazer com que os nossos esformços para derrubar patentes de software individuais realizar uma dupla tarefa, construindo suporte para os esforços para corrigir o problema inteiro. O ponto crucial é não igualar patentes de software “más” com patentes de software erradas ou inválidas. Cada vez que nós invalidamos uma patente de software, cada vez que nós falamos dos nosso planos de tentar, nós devemos dizer em termos não incertos, “Uma patente de software a menos, uma ameaça a menos para os programadores: o alvo é zero.”

source: The battle over software patents in the European Union is reaching a crucial stage. The European Parliament voted a year ago to reject software patents conclusively. In May, the Council of Ministers voted to undo the Parliament's amendments and make the directive even worse than when it started. However, at least one country that supported this has already reversed its vote. We must all do our utmost right now to convince an additional European country to change its vote, and to convince the newly elected members of the European Parliament to stand behind the previous vote. Please refer to <a href="http://www.ffii.org/"> www.ffii.org</a> for more information on how to help, and to get in touch with other activists.
pt_br: A batalha contra patentes de software na União Européia está chegando a um estágio crucial. O Parlamento Europeu votou há um ano atrás para rejeitar patentes de software de forma conclusiva. Em maio, o Conselho de Ministros votou para desfazer as modificações do Parlamento e tornar a diretiva ainda pior doq eu quando começou. No entanto, pelo menos um país que contribuiu para isso já reverteu o seu voto. Nós todos devemos fazer o máximo agora para convencer um país europeu a mais para mudar o seu voto, e para convencer os novos membros eleitos do Parlamento Europeu para manter o voto de antes. Acesse <a href="http://www.ffii.org/"> www.ffii.org</a> para mais informações sobre como ajudar, e para entrar em contato com outros ativistas.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
pt_br: Esta página está licenciada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.pt_BR">Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: Traduzido por: César Blum Silveira <a href="mailto:cesarbs@brturbo.com">&lt;cesarbs@brturbo.com&gt;</a>

source: Updated:
pt_br: Última atualização:
