Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/shouldbefree.*.po
Languages: pt_br

source: I have shown how ownership of a program&mdash;the power to restrict changing or copying it&mdash;is obstructive. Its negative effects are widespread and important. It follows that society shouldn't have owners for programs.
pt_br: Eu mostrei como a propriedade de um programa — o poder de restringir as alterações ou a cópia dele — é obstrusivo. Seus efeitos negativos são amplamente disseminados e importantes. Segue que a sociedade não deveria ter proprietários para programas.

source: Another way to understand this is that what society needs is free software, and proprietary software is a poor substitute. Encouraging the substitute is not a rational way to get what we need.
pt_br: Outra maneira de entender isto é ver que o que a sociedade precisa é de software livre, e software proprietário é um substituto pobre. Encorajar o substituto não é uma maneira racional de obter o que nós precisamos.

source: Vaclav Havel has advised us to &ldquo;Work for something because it is good, not just because it stands a chance to succeed.&rdquo; A business making proprietary software stands a chance of success in its own narrow terms, but it is not what is good for society.
pt_br: Vaclav Havel nos aconselhou: “Trabalhe por algo porque é bom e não apenas porque tem chance de sucesso.” Um negócio fazendo software proprietário tem chance de sucesso dentro dos seus próprios termos limitados, mas não é o que é bom para a sociedade.

source: Why People Will Develop Software
pt_br: Porque as Pessoas Irão Desenvolver Software

source: If we eliminate copyright as a means of encouraging people to develop software, at first less software will be developed, but that software will be more useful. It is not clear whether the overall delivered user satisfaction will be less; but if it is, or if we wish to increase it anyway, there are other ways to encourage development, just as there are ways besides toll booths to raise money for streets. Before I talk about how that can be done, first I want to question how much artificial encouragement is truly necessary.
pt_br: Se nós eliminarmos a copyright como meio de estimular pessoas a desenvolver software, no início menos software será desenvolvido, mas este software será mais útil. Não está claro se a satisfação geral proporcionada será menor; mas se for, ou se de qualquer jeito nós quisermos aumentá-la, existem outras maneiras de estimular desenvolvimento, assim como existem outras maneiras de levantar fundos para estradas sem usar pedágios. Antes de falar a respeito de como isso pode ser feito, primeiro eu gostaria de questionar o quanto de incentivo artificial é realmente necessario.

source: Programming is Fun
pt_br: Programar é Divertido

source: There are some lines of work that few will enter except for money; road construction, for example. There are other fields of study and art in which there is little chance to become rich, which people enter for their fascination or their perceived value to society. Examples include mathematical logic, classical music, and archaeology; and political organizing among working people. People compete, more sadly than bitterly, for the few funded positions available, none of which is funded very well. They may even pay for the chance to work in the field, if they can afford to.
pt_br: Existem algumas linhas de trabalho em que poucos irão entrar exceto por dinheiro; construção de rodovias, por exemplo. Existem outras áreas de estudo e arte em que existe pouca chance de se tornar rico, em que pessoas entram pela sua fascinação ou pelo percebido valor para a sociedade. Exemplos incluem a lógica matemática, música clássica, arqueologia e organização política entre trabalhadores. Pessoas competem por novas vagas, nenhuma das quais é muito bem remunerada. Elas chegam até a pagar pela chance de trabalhar na área, se elas têm condições para isso.

source: Such a field can transform itself overnight if it begins to offer the possibility of getting rich. When one worker gets rich, others demand the same opportunity. Soon all may demand large sums of money for doing what they used to do for pleasure. When another couple of years go by, everyone connected with the field will deride the idea that work would be done in the field without large financial returns. They will advise social planners to ensure that these returns are possible, prescribing special privileges, powers, and monopolies as necessary to do so.
pt_br: Uma área assim pode se transformar do dia pra noite se começar a oferecer a possibilidade de ficar rico. Quando um trabalhador fica rico, outros querem a mesma oportunidade. Logo todos querem grandes somas em dinheiro para fazer o que eles costumavam fazer por prazer. Quando se passam mais alguns anos, todos ligados àquele campo irão ridicularizar a idéia que trabalho poderia ser executado naquela área sem grandes retornos financeiros. Eles irão aconselhar os planejadores sociais a assegurar que estes retornos sejam possíveis, prescrevendo privilégios especiais, poderes e monopólios à medida do necessário para que isto aconteça.

source: When it is true at a given time that most people will work in a certain field only for high pay, it need not remain true. The dynamic of change can run in reverse, if society provides an impetus. If we take away the possibility of great wealth, then after a while, when the people have readjusted their attitudes, they will once again be eager to work in the field for the joy of accomplishment.
pt_br: Quando é verdade em um determinado momento que a maioria das pessoas irão trabalhar numa certa área por altos pagamentos, isto não precisa continuar sendo verdade. A dinâmica da mudança pode acontecer ao contrário, se a sociedade fornecer o ímpeto. Se nós tirarmos a possibilidade de grande riqueza, então depois de um breve momento, quando as pessoas tiverem reajustado suas atitudes, elas irão mais uma vez ansiar por trabalhar na área pelo prazer da conquista.

source: The question &ldquo;How can we pay programmers?&rdquo; becomes an easier question when we realize that it's not a matter of paying them a fortune. A mere living is easier to raise.
pt_br: A questão “Como nós podemos pagar programadores?” se torna mais fácil quando nós entendemos que não é uma questão de pagá-los uma fortuna. Um mero viver é mais fácil de se conseguir.

source: Funding Free Software
pt_br: Financiando o Software Livre

source: Institutions that pay programmers do not have to be software houses. Many other institutions already exist that can do this.
pt_br: Instituições que pagam programadores não têm que ser software houses. Muitas outras instituições já existem que podem fazer isto.

source: Hardware manufacturers find it essential to support software development even if they cannot control the use of the software. In 1970, much of their software was free because they did not consider restricting it. Today, their increasing willingness to join consortiums shows their realization that owning the software is not what is really important for them.
pt_br: Fabricantes de equipamentos acham essencial suportar desenvolvimento de software mesmo que eles não controlem o uso do software. Em 1970, muito do seu software era livre porque eles não consideravam a possibilidade de restringi-lo. Hoje, a sua crescente disposição para combinar consórcios mostra seu entendimento que possuir o software não é o que é realmente importante para eles.

source: Universities conduct many programming projects. Today they often sell the results, but in the 1970s they did not. Is there any doubt that universities would develop free software if they were not allowed to sell software? These projects could be supported by the same government contracts and grants that now support proprietary software development.
pt_br: Universidades conduzem muitos projetos de programação. Hoje, elas freqüentemente vendem os resultados, mas nos anos 70, elas não vendiam. Existe alguma dúvida de que as universidades iriam desenvolver software livre se não lhes fosse permitido vender software? Estes projetos poderiam ser suportados pelos mesmos contratos de governo e concessões que agora suportam o desenvolvimento de software proprietário.

source: It is common today for university researchers to get grants to develop a system, develop it nearly to the point of completion and call that &ldquo;finished&rdquo;, and then start companies where they really finish the project and make it usable. Sometimes they declare the unfinished version &ldquo;free&rdquo;; if they are thoroughly corrupt, they instead get an exclusive license from the university. This is not a secret; it is openly admitted by everyone concerned. Yet if the researchers were not exposed to the temptation to do these things, they would still do their research.
pt_br: É comum hoje para pesquisadores de universidade pegar concessão para desenvolver um sistema, desenvolvê-lo até quase o término e dá-lo por “terminado”, e então começar empresas onde eles realmente terminam o projeto e o tornam útil. Às vezes eles declaram as versões inacabadas como “gratuitas”; se eles são profundamente corruptos, eles em vez disso obtém uma licença exclusiva da universidade. Isto não é nenhum segredo; é abertamente admitido por todos os interessados. Já se os pesquisadores não fossem expostos à tentação de fazer estas coisas, eles ainda assim fariam suas pesquisas.

source: Programmers writing free software can make their living by selling services related to the software. I have been hired to port the <a href="/software/gcc/">GNU C compiler</a> to new hardware, and to make user-interface extensions to <a href="/software/emacs/">GNU Emacs</a>. (I offer these improvements to the public once they are done.) I also teach classes for which I am paid.
pt_br: Programadores que escrevem software livre podem ganhar a vida vendendo serviços relacionados ao software. Eu tenho sido contratado para portar o <a href="/software/gcc/">compilador C GNU</a> para novos equipamentos, e para fazer extensões à interface do usuário no <a href="/software/emacs/">GNU Emacs</a>. (Eu ofereço estas melhorias ao público uma vez que elas ficam prontas.) Eu também ensino em salas-de-aula, pelo que eu sou pago.

source: I am not alone in working this way; there is now a successful, growing corporation which does no other kind of work. Several other companies also provide commercial support for the free software of the GNU system. This is the beginning of the independent software support industry&mdash;an industry that could become quite large if free software becomes prevalent. It provides users with an option generally unavailable for proprietary software, except to the very wealthy.
pt_br: Eu não sou o único que trabalha desta forma; existe hoje uma empresa crescente e bem sucedida que não faz outra coisa. Diversas outras empresas também fornecem suporte comercial para software livre do sistema GNU. Isto é o começo de uma indústria de suporte ao software independente — uma indústria que poderia se tornar muito grande se o software livre se tornasse predominante. Ela dá aos usuários uma opção geralmente não disponível para o software proprietário, exceto para os muito ricos.

source: New institutions such as the <a href="/fsf/fsf.html">Free Software Foundation</a> can also fund programmers. Most of the Foundation's funds come from users buying tapes through the mail. The software on the tapes is free, which means that every user has the freedom to copy it and change it, but many nonetheless pay to get copies. (Recall that &ldquo;free software&rdquo; refers to freedom, not to price.) Some users who already have a copy order tapes as a way of making a contribution they feel we deserve. The Foundation also receives sizable donations from computer manufacturers.
pt_br: Novas instituições tais como a <a href="/fsf/fsf.html">Foundação para o Software Livre</a> podem também pagar programadores. A maior parte dos fundos da fundação vem de usuários comprarem fitas através do correio. O software nas fitas é livre, o que significa que todo usuário tem a liberdade de copiá-lo e alterá-lo, mas muitos apesar de tudo pagam para obter cópias. (Lembre-se que “free software” se refere a liberdade e não preço). Alguns usuários adquirem fitas para as quais eles já tem uma cópia, como uma maneira de fazer uma contribuição que eles sentem que nós merecemos. A Fundação também recebe donativos consideráveis de fabricantes de computadores.

source: The Free Software Foundation is a charity, and its income is spent on hiring as many programmers as possible. If it had been set up as a business, distributing the same free software to the public for the same fee, it would now provide a very good living for its founder.
pt_br: A Fundação para o Software Livre é uma entidade, e suas receitas são gastas contratando tantos programadores quanto possível. Se ela tivesse sido feita para ganhos financeiros, distribuindo o mesmo software livre ao público pelos mesmos valores, daria agora uma vida muito boa ao seu fundador.

source: Because the Foundation is a charity, programmers often work for the Foundation for half of what they could make elsewhere. They do this because we are free of bureaucracy, and because they feel satisfaction in knowing that their work will not be obstructed from use. Most of all, they do it because programming is fun. In addition, volunteers have written many useful programs for us. (Even technical writers have begun to volunteer.)
pt_br: Em virtude da Fundação ser uma entidade, programadores freqüentemente trabalham pra ela por metade do que eles poderiam ganhar em outro lugar. Eles fazem isto porque nós somos livres de burocracia, e porque eles sentem satisfação em saber que seu trabalho não será obstruído. Acima de tudo, eles fazem isso porque programar é divertido. Fora isso, voluntários têm escrito muitos programas úteis para nós. (Recentemente mesmo escritores técnicos começaram a se oferecer.)

source: This confirms that programming is among the most fascinating of all fields, along with music and art. We don't have to fear that no one will want to program.
pt_br: Isto confirma que programação está entre as áreas mais fascinantes de todas, junto da música e da arte. Nós não temos medo que ninguém queira programar.

source: What Do Users Owe to Developers?
pt_br: O Que os Usuários Devem aos Desenvolvedores?

source: There is a good reason for users of software to feel a moral obligation to contribute to its support. Developers of free software are contributing to the users' activities, and it is both fair and in the long-term interest of the users to give them funds to continue.
pt_br: Existe uma boa razão para os usuários de software sentirem uma obrigação moral de contribuir para seu suporte. Desenvolvedores de software livre estão contribuindo para as atividades dos usuários, e é justo e a longo prazo interessante para os usuários prover os fundos para continuar.

source: However, this does not apply to proprietary software developers, since obstructionism deserves a punishment rather than a reward.
pt_br: No entanto, isto não se aplica a software proprietário, uma vez que o obstrucionismo merece uma punição em vez de uma recompensa.

source: We thus have a paradox: the developer of useful software is entitled to the support of the users, but any attempt to turn this moral obligation into a requirement destroys the basis for the obligation. A developer can either deserve a reward or demand it, but not both.
pt_br: Nós temos assim um paradoxo: o desenvovedore de software útil tem direito ao suporte dos usuários, mas qualquer tentativa de tornar esta obrigação moral numa exigência destrói a base para a obrigação. Um desenvovedor pode tanto merecer a recompensa quanto exigi-la, mas não ambos.

source: I believe that an ethical developer faced with this paradox must act so as to deserve the reward, but should also entreat the users for voluntary donations. Eventually the users will learn to support developers without coercion, just as they have learned to support public radio and television stations.
pt_br: Eu acredito que um desenvolvedor ético defrontado com este paradoxo deve agir de modo a merecer a recompensa, mas deveria também solicitar aos usuários donativos voluntários. No final das contas os usuários irão aprender a suportar os desenvolvedores sem coerção, assim como eles aprenderam a suportar as estações públicas de rádio e televisão.

source: What Is Software Productivity?
pt_br: O Que É Produtividade De Software?

source: If software were free, there would still be programmers, but perhaps fewer of them. Would this be bad for society?
pt_br: Se o software fosse livre, ainda assim existiriam programadores, mas talvez um número menor deles. Seria isto ruim para a sociedade?

source: Not necessarily. Today the advanced nations have fewer farmers than in 1900, but we do not think this is bad for society, because the few deliver more food to the consumers than the many used to do. We call this improved productivity. Free software would require far fewer programmers to satisfy the demand, because of increased software productivity at all levels:
pt_br: Não necessariamente. Hoje as nações avançadas têm menos fazendeiros que em 1900, mas nós não achamos que isto seja ruim para a sociedade, porque os em menor número fornecem mais comida aos consumidores do que os em maior número faziam. Nós chamamos isso de produtividade melhorada. Software livre exigiria muito menos programadores para satisfazer a demanda, por causa da produtividade de software aumentada em todos os níveis:

source: Wider use of each program that is developed.
pt_br: Uso mais amplo de cada programa que é desenvolvido.

source: The ability to adapt existing programs for customization instead of starting from scratch.
pt_br: A habilidade de adaptar programas para personalização em vez de começar do zero.

source: Better education of programmers.
pt_br: Melhor educação de programadores.

source: The elimination of duplicate development effort.
pt_br: A eliminação de esforço de desenvolvimento duplicado.

source: Those who object to cooperation claiming it would result in the employment of fewer programmers are actually objecting to increased productivity. Yet these people usually accept the widely held belief that the software industry needs increased productivity. How is this?
pt_br: Aqueles que se opõem à cooperação porque isso resultaria no emprego de menos programadores, estão na verdade se opondo à produtividade melhorada. Estas mesmas pessoas normalmente concordam com a crença largamente aceita que a indústria de software precisa de produtividade melhorada. Pode?

source: &ldquo;Software productivity&rdquo; can mean two different things: the overall productivity of all software development, or the productivity of individual projects. Overall productivity is what society would like to improve, and the most straightforward way to do this is to eliminate the artificial obstacles to cooperation which reduce it. But researchers who study the field of &ldquo;software productivity&rdquo; focus only on the second, limited, sense of the term, where improvement requires difficult technological advances.
pt_br: “Produtividade de Software” pode significar duas coisas diferentes: a produtividade geral de todo o desenvolvimento de software ou a produtividade de projetos individuais. Produtividade geral é o que a sociedade gostaria de ver melhorada e a maneira mais direta de fazer isto é eliminar os obstáculos artificiais à cooperação que a reduzem. Mas pesquisadores que estudam a área de “produtividade de software” focam somente no segundo, limitado, sentido da frase, onde melhoria requer avanços tecnológicos difíceis.

source: Is Competition Inevitable?
pt_br: A Competição É Inevitável?

source: Is it inevitable that people will try to compete, to surpass their rivals in society? Perhaps it is. But competition itself is not harmful; the harmful thing is <em>combat</em>.
pt_br: É inevitável que as pessoas tentem competir, sobrepujando seus rivais em sociedade? Talvez sim. Mas competição por si só não é prejudicial; o que é prejudicial é o <em>combate</em>.

source: There are many ways to compete. Competition can consist of trying to achieve ever more, to outdo what others have done. For example, in the old days, there was competition among programming wizards&mdash;competition for who could make the computer do the most amazing thing, or for who could make the shortest or fastest program for a given task. This kind of competition can benefit everyone, <em>as long as</em> the spirit of good sportsmanship is maintained.
pt_br: Existem maneiras de competir. Competição pode consistir de tentar alcaçar cada vez mais, exceder o que outros fizeram. Por exemplo, antigamente, haviam competições entre magos da programação — competição para ver quem poderia fazer o computadore executar a coisa mais impressionante, ou fazer o mais curto ou mais rápido programa para uma dada tarefa. Este tipo de competição pode beneficiar a todos, <em>contanto que</em> o espírito esportivo seja mantido.

source: Constructive competition is enough competition to motivate people to great efforts. A number of people are competing to be the first to have visited all the countries on Earth; some even spend fortunes trying to do this. But they do not bribe ship captains to strand their rivals on desert islands. They are content to let the best person win.
pt_br: Competição construtiva é competição suficiente para motivar pessoas a grandes esforços. Algumas pessoas estão competindo para ver quem será o primeiro a ter visitado todos os países da Terra; alguns até mesmo já gastaram fortunas tentando isso. Mas eles não subornam captães de navio para encalhar seus rivais em ilhas desertas. Eles estão satisfeitos em que vença o melhor.

source: Competition becomes combat when the competitors begin trying to impede each other instead of advancing themselves&mdash;when &ldquo;Let the best person win&rdquo; gives way to &ldquo;Let me win, best or not.&rdquo; Proprietary software is harmful, not because it is a form of competition, but because it is a form of combat among the citizens of our society.
pt_br: Competição se torna combate quando os competidores começam a tentar impedir um ao outro de avançar — quando o “que vença o melhor” dá lugar ao “que eu vença, sendo ou não o melhor.” Software proprietário é prejudicial, não porque seja uma forma de competição, mas porque é uma forma de combate entre cidadãos da nossa sociedade.

source: Competition in business is not necessarily combat. For example, when two grocery stores compete, their entire effort is to improve their own operations, not to sabotage the rival. But this does not demonstrate a special commitment to business ethics; rather, there is little scope for combat in this line of business short of physical violence. Not all areas of business share this characteristic. Withholding information that could help everyone advance is a form of combat.
pt_br: Competição em negócios não é necessariamente combate. Por exemplo, quando duas mercearias competem, todo seu esforço é para melhorar as suas próprias operações, não para sabotar a rival. Mas isto não demostra um compromisso especial com a ética de negócios; em vez disso, há pouco espaço para combate nesta linha de negócio a não ser violência física. Nem todas as áreas de negócio compartilham esta característica: ocultar informação que poderia ajudar o avanço de todos é uma forma de combate.
