Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/shouldbefree.*.po
Languages: pt_br

source: This reflects a crucial difference between copies of programs and cars, chairs, or sandwiches. There is no copying machine for material objects outside of science fiction. But programs are easy to copy; anyone can produce as many copies as are wanted, with very little effort. This isn't true for material objects because matter is conserved: each new copy has to be built from raw materials in the same way that the first copy was built.
pt_br: Isto traz à luz uma diferença crucial entre cópias de programas e carros, cadeiras, ou sanduíches. Não existe máquina copiadora de objetos materiais, a não ser em ficção científica. Mas programas são fáceis de copiar; qualquer um pode produzir tantas cópias quantas quizer, com muito pouco esforço. Isto não é verdade para objetos materiais porque a matéria é conservada: cada nova cópia tem que ser construída de matéria-prima da mesma maneira que a primeira cópia foi.

source: With material objects, a disincentive to use them makes sense, because fewer objects bought means less raw material and work needed to make them. It's true that there is usually also a startup cost, a development cost, which is spread over the production run. But as long as the marginal cost of production is significant, adding a share of the development cost does not make a qualitative difference. And it does not require restrictions on the freedom of ordinary users.
pt_br: Com objetos materiais, um desincentivo para utilizá-los faz sentido, porque menos objetos comprados significa menos matéria-prima e trabalho necessários para construí-los. É verdade que normalmente existe um custo inicial, um custo de desenvolvimento, que é distribuido na produção em massa. Mas uma vez que o custo de produção seja significativo, acrescentar uma parcela do custo de desenvolvimento não faz uma diferença qualitativa. E não requer restrições sobre a liberdade dos usuários comuns.

source: However, imposing a price on something that would otherwise be free is a qualitative change. A centrally imposed fee for software distribution becomes a powerful disincentive.
pt_br: No entanto, impor um preço em algo que de outro modo seria gratuito é uma mudança qualitativa. Uma taxa centralmente imposta para a distribuição do software se torna um desincentivo poderoso.

source: What's more, central production as now practiced is inefficient even as a means of delivering copies of software. This system involves enclosing physical disks or tapes in superfluous packaging, shipping large numbers of them around the world, and storing them for sale. This cost is presented as an expense of doing business; in truth, it is part of the waste caused by having owners.
pt_br: E tem mais, a produção centralizada como é praticada atualmente é ineficiente mesmo como meio de distribuição de cópias de software. Este sistema envolve acomodar discos ou fitas em um empacotamento supérfluo, enviando um grande número deles ao redor do mundo, e armazenando-os para a venda. Este custo é apresentado como uma despesa de negócio; na verdade, é parte do desperdício causado por ter proprietários.

source: Damaging Social Cohesion
pt_br: Prejudicando a União Social

source: Suppose that both you and your neighbor would find it useful to run a certain program. In ethical concern for your neighbor, you should feel that proper handling of the situation will enable both of you to use it. A proposal to permit only one of you to use the program, while restraining the other, is divisive; neither you nor your neighbor should find it acceptable.
pt_br: Suponha que você e seu colega achassem útil rodar um certo programa. Num concenso ético com seu colega você sente que a maneira apropriada de lidar com a situação é permitir que ambos utilizem o programa. Uma proposta que permitisse a somente um dos dois a utilização do programa excluindo o outro causaria desarmonia; nem você nem seu colega achariam aceitável.

source: Signing a typical software license agreement means betraying your neighbor: &ldquo;I promise to deprive my neighbor of this program so that I can have a copy for myself.&rdquo; People who make such choices feel internal psychological pressure to justify them, by downgrading the importance of helping one's neighbors&mdash;thus public spirit suffers. This is psychosocial harm associated with the material harm of discouraging use of the program.
pt_br: Aceitar um típico acordo de licença de software significa trair seu colega: “Eu prometo privar meu colega deste programa de modo que eu possa ter uma cópia para mim.” As pessoas que fazem opções deste tipo sentem uma pressão psicológica interna para se justificar, desmerecendo a importância da cooperação mútua — assim o espírito público é prejudicado. Este é um dano psico-social associado com o dano material de desencorajar o uso do programa.

source: Many users unconsciously recognize the wrong of refusing to share, so they decide to ignore the licenses and laws, and share programs anyway. But they often feel guilty about doing so. They know that they must break the laws in order to be good neighbors, but they still consider the laws authoritative, and they conclude that being a good neighbor (which they are) is naughty or shameful. That is also a kind of psychosocial harm, but one can escape it by deciding that these licenses and laws have no moral force.
pt_br: Muitos usuários inconscientemente reconhecem o erro de se recusar a compartilhar, então eles decidem ignorar as licenças e as leis, e compartilham programas de qualquer forma. Mas eles freqüentemente se sentem culpados por agirem assim. Eles sabem que devem quebrar as leis para serem bons colegas, mas ainda assim reconhecem a autoridade das leis, então concluem que ser um bom companheiro (que eles são) é perverso ou vergonhoso. Isto também é um tipo de dano psico-social, mas alguém pode escapar disto decidindo que estas licenças e leis não têm força moral.

source: Programmers also suffer psychosocial harm knowing that many users will not be allowed to use their work. This leads to an attitude of cynicism or denial. A programmer may describe enthusiastically the work that he finds technically exciting; then when asked, &ldquo;Will I be permitted to use it?&rdquo;, his face falls, and he admits the answer is no. To avoid feeling discouraged, he either ignores this fact most of the time or adopts a cynical stance designed to minimize the importance of it.
pt_br: Os programadores também sofrem dano psico-social por saber que muitos usuários não terão o direito de tirar proveito do seu trabalho. Isto leva a uma atitude de cinismo ou negação. Um programador pode descrever entusiasticamente o trabalho que ele acha tecnologicamente interessante; então quando perguntado, “Eu vou poder usar isso?”, seu semblante cai e ele admite que a resposta é não. Para evitar se sentir desestimulado, ele ou ignora isso a maior parte do tempo ou adota uma postura cínica elaborada para minimizar a relevância do fato.

source: Since the age of Reagan, the greatest scarcity in the United States is not technical innovation, but rather the willingness to work together for the public good. It makes no sense to encourage the former at the expense of the latter.
pt_br: Desde a época do governo Reagan, a maior escassez nos Estados Unidos não é inovação tecnológica e sim a disposição de trabalhar junto para o bem público. Não faz sentido estimular o primeiro às custas do segundo.

source: Obstructing Custom Adaptation of Programs
pt_br: Obstruindo a Adaptação Personalizada de Programas

source: The second level of material harm is the inability to adapt programs. The ease of modification of software is one of its great advantages over older technology. But most commercially available software isn't available for modification, even after you buy it. It's available for you to take it or leave it, as a black box&mdash;that is all.
pt_br: O segundo nível de dano material é a impossibilidade de adaptar programas. A facilidade de modificação do software é uma das suas grandes vantagens em relação às tecnologias mais antigas. Mas a maior parte do software disponível comercialmente não está disponível para modificação, mesmo depois de você comprá-lo. Está disponível para você pegar ou largar, como uma caixa preta — e isto é tudo.

source: A program that you can run consists of a series of numbers whose meaning is obscure. No one, not even a good programmer, can easily change the numbers to make the program do something different.
pt_br: Um programa que você pode rodar consiste numa série de números cujo significado é obscuro. Ninguém, nem mesmo um bom programador, pode facilmente mudar os números para fazer com que o programa aja diferente.

source: Programmers normally work with the &ldquo;source code&rdquo; for a program, which is written in a programming language such as Fortran or C. It uses names to designate the data being used and the parts of the program, and it represents operations with symbols such as &lsquo;+&rsquo; for addition and &lsquo;-&rsquo; for subtraction. It is designed to help programmers read and change programs. Here is an example; a program to calculate the distance between two points in a plane:
pt_br: Programadores normalmente trabalham com o “código fonte” do programa, que é escrito numa linguagem de programação como Fortran ou C. Ela usa nomes para designar os dados utilizados e as partes do programa, e representa operações com símbolos como '+' para adição e '-' para subtração. Isto é feito para auxiliar os programadores a ler e alterar programas. Aqui está um exemplo; um programa para calcular a distância entre dois pontos num plano:

source: Source code is useful (at least potentially) to every user of a program. But most users are not allowed to have copies of the source code. Usually the source code for a proprietary program is kept secret by the owner, lest anybody else learn something from it. Users receive only the files of incomprehensible numbers that the computer will execute. This means that only the program's owner can change the program.
pt_br: Código fonte é útil (no mínimo em potencial) para qualquer usuário de um programa. Mas a maioria dos usuários não tem permissão para ter cópias do código fonte. Normalmente o código fonte de um programa proprietário é mantido em segredo pelo proprietário, evitando que qualquer pessoa possa aprender a partir dele. Usuários recebem apenas os arquivos contendo números incompreensíveis que o computador irá executar. Isto significa que somente o proprietário do programa pode alterá-lo.

source: A friend once told me of working as a programmer in a bank for about six months, writing a program similar to something that was commercially available. She believed that if she could have gotten source code for that commercially available program, it could easily have been adapted to their needs. The bank was willing to pay for this, but was not permitted to&mdash;the source code was a secret. So she had to do six months of make-work, work that counts in the GNP but was actually waste.
pt_br: Uma amiga me disse uma vez que ela estava trabalhando em um banco durante aproximadamente seis meses, escrevendo um programa similar a algo que estava disponível comercialmente. Ela acreditava que se pudesse ter acesso ao código fonte para aquele programa disponível comercialmente, ele poderia ter sido adaptado facilmente às suas necessidades. O banco estava disposto a pagar por isso, mas não lhe foi permitido — o código fonte era um segredo. Sendo assim ela teve que gastar seis meses nesta tarefa, trabalho este que conta no Produto Interno Bruto mas que na verdade foi desperdício.

source: The <abbr title="Massachusetts Institute of Technology">MIT</abbr> Artificial Intelligence Lab (AI Lab) received a graphics printer as a gift from Xerox around 1977. It was run by free software to which we added many convenient features. For example, the software would notify a user immediately on completion of a print job. Whenever the printer had trouble, such as a paper jam or running out of paper, the software would immediately notify all users who had print jobs queued. These features facilitated smooth operation.
pt_br: O laboratório de Inteligência Artificial do <abbr title="Massachusetts Institute of Technology">MIT</abbr> (laboratório de AI) recebeu uma impressora gráfica como presente da Xerox por volta de 1977. Funcionava com software livre ao qual nós adicionamos muitas funcionalidades convenientes. Por exemplo, o software notificava um usuário imediatamente ao término de uma impressão. Sempre que a impressora tinha algum problema, tal como papel preso ou falta de papel, o software imediatamente notificava todos os usuários que tinham impressões na fila. Estas funcionalidades facilitavam a operação tranqüila.

source: Later Xerox gave the AI Lab a newer, faster printer, one of the first laser printers. It was driven by proprietary software that ran in a separate dedicated computer, so we couldn't add any of our favorite features. We could arrange to send a notification when a print job was sent to the dedicated computer, but not when the job was actually printed (and the delay was usually considerable). There was no way to find out when the job was actually printed; you could only guess. And no one was informed when there was a paper jam, so the printer often went for an hour without being fixed.
pt_br: Mais tarde a Xerox deu ao laboratório de AI uma impressora mais nova, mais rápida, uma das primeiras impressoras a laser. Ela era controlada por um software proprietário que rodava em um computador dedicado separado, sendo assim nós não poderíamos acrescentar qualquer das nossas funcionalidades favoritas. Nós poderíamos organizar as coisas de modo a enviar uma notificação quando a tarefa de impressão fosse enviada ao computador dedicado, mas não quando a impressão realmente fosse feita (e o atraso era normalmente considerável). Não havia modo de saber quando a impressão era realmente concluída; você poderia somente chutar. E ninguém era informado quando havia um papel enroscado, de modo que a impressora freqüentemente ficava por uma hora parada.

source: The system programmers at the AI Lab were capable of fixing such problems, probably as capable as the original authors of the program. Xerox was uninterested in fixing them, and chose to prevent us, so we were forced to accept the problems. They were never fixed.
pt_br: Os programadores de sistema do laboratório de AI eram capazes de corrigir estes problemas, provavelmente tão capazes quanto os autores originais do programa. A Xerox não estava interessada em corrigí-los no entanto, e preferiu nos impedir, de modo que nós fomos forçados a aceitar os problemas. Eles nunca foram corrigidos.

source: Most good programmers have experienced this frustration. The bank could afford to solve the problem by writing a new program from scratch, but a typical user, no matter how skilled, can only give up.
pt_br: A maioria dos bons programadores já passou por esta frustração. O banco pôde se permitir resolver o problema escrevendo um novo programa do zero, mas um usuário típico, não importa o quão conhecedor, não tem outra alternativa senão desistir.

source: Giving up causes psychosocial harm&mdash;to the spirit of self-reliance. It is demoralizing to live in a house that you cannot rearrange to suit your needs. It leads to resignation and discouragement, which can spread to affect other aspects of one's life. People who feel this way are unhappy and do not do good work.
pt_br: Desistência causa dano psico-social — ao espírito da auto-confiança. É desmoralizante viver numa casa que você não pode reorganizar para satisfazer as suas necessidades. Isto leva à resignação e desencorajamento, que pode se espalhar e afetar outros aspectos da vida de uma pessoa. Pessoas que se sentem assim são infelizes e não produzem um bom trabalho.

source: Imagine what it would be like if recipes were hoarded in the same fashion as software. You might say, &ldquo;How do I change this recipe to take out the salt?&rdquo; and the great chef would respond, &ldquo;How dare you insult my recipe, the child of my brain and my palate, by trying to tamper with it? You don't have the judgment to change my recipe and make it work right!&rdquo;
pt_br: Imagine o que aconteceria se receitas culinárias fossem entesouradas como o software. Você poderia dizer, “Como eu mudo esta receita para tirar o sal?”, e o grande chefe de cozinha te responderia, “Como ousa insultar minha receita, o fruto do meu cérebro e do meu paladar, tentando mexer nela? Você não tem conhecimento para alterar minha receita e fazê-la funcionar.”

source: &ldquo;But my doctor says I'm not supposed to eat salt! What can I do? Will you take out the salt for me?&rdquo;
pt_br: “Mas meu médico disse que eu não posso comer sal! O que eu posso fazer? Você vai tirar o sal pra mim?”

source: &ldquo;I would be glad to do that; my fee is only $50,000.&rdquo; Since the owner has a monopoly on changes, the fee tends to be large. &ldquo;However, right now I don't have time. I am busy with a commission to design a new recipe for ship's biscuit for the Navy Department. I might get around to you in about two years.&rdquo;
pt_br: “Eu faria com muito prazer; meus honorários são de apenas $50.000.” Uma vez que o proprietário tem o monopólio nas alterações, os honorários tendem a ser grandes. “No entanto, justamente agora eu não tenho tempo. Estou ocupado com uma comissão para projetar uma nova receita para o biscoito do navio para o Departamento da Marinha. Posso te dar um retorno daqui a dois anos.”

source: Obstructing Software Development
pt_br: Obstruindo Desenvolvimento de Software

source: The third level of material harm affects software development. Software development used to be an evolutionary process, where a person would take an existing program and rewrite parts of it for one new feature, and then another person would rewrite parts to add another feature; in some cases, this continued over a period of twenty years. Meanwhile, parts of the program would be &ldquo;cannibalized&rdquo; to form the beginnings of other programs.
pt_br: O terceiro nível de dano material afeta o desenvolvimento de software. Desenvolvimento de software constumava ser um processo evolucionário, onde uma pessoa pegava um programa existente e reescrevia partes dele para obter uma nova funcionalidade, e então outra pessoa iria reescrever partes para adicionar outra funcionalidade; em alguns casos isso continuava por um período de vinte anos. Neste meio-tempo, partes do programa eram “canibalizadas” para formar o princípio de outros programas.

source: The existence of owners prevents this kind of evolution, making it necessary to start from scratch when developing a program. It also prevents new practitioners from studying existing programs to learn useful techniques or even how large programs can be structured.
pt_br: A existência de proprietários impede este tipo de evolução, tornando necessário começar do zero quando do desenvolvimento de um programa. Também impede novos praticantes de estudar programas existentes para aprender técnicas úteis ou mesmo como grandes programas podem ser estruturados.

source: Owners also obstruct education. I have met bright students in computer science who have never seen the source code of a large program. They may be good at writing small programs, but they can't begin to learn the different skills of writing large ones if they can't see how others have done it.
pt_br: Proprietários também obstruem a educação. Eu tenho conhecido estudantes brilhantes em ciência da computação que nunca viram o código fonte de um programa grande. Eles podem ser bons para escrever pequenos programas, mas eles não podem começar a aprender os conhecimentos diferentes que são necessários para a construção de grandes programas se eles não podem ver como outros fizeram isto.

source: In any intellectual field, one can reach greater heights by standing on the shoulders of others. But that is no longer generally allowed in the software field&mdash;you can only stand on the shoulders of the other people <em>in your own company</em>.
pt_br: Em qualquer área intelectual, uma pessoa pode alcançar maiores alturas subindo nos ombros de outros. Mas geralmente isto não é mais permitido na área de software — você pode somente subir nos ombros das outras pessoas dentro <em>da sua empresa</em>.

source: The associated psychosocial harm affects the spirit of scientific cooperation, which used to be so strong that scientists would cooperate even when their countries were at war. In this spirit, Japanese oceanographers abandoning their lab on an island in the Pacific carefully preserved their work for the invading U.S. Marines, and left a note asking them to take good care of it.
pt_br: O dano psico-social associado afeta o espírito da cooperação científica, que constumava ser tão forte que cientistas cooperariam mesmo quando suas nações estava em guerra. Embuidos deste espírito, oceanógrafos japoneses abandonando seu laboratório numa ilha do Pacífico cuidadosamente preservaram seu trabalho para os soldados invasores dos Estados Unidos, e deixaram uma nota pedindo que eles tomassem cuidado com aquilo.

source: Conflict for profit has destroyed what international conflict spared. Nowadays scientists in many fields don't publish enough in their papers to enable others to replicate the experiment. They publish only enough to let readers marvel at how much they were able to do. This is certainly true in computer science, where the source code for the programs reported on is usually secret.
pt_br: Conflitos por lucro têm destruido o que conflitos internacionais pouparam. Hoje em dia cientistas em muitas áreas não publicam o suficiente nos seus ensaios para permitir que outros reproduzam suas experiências. Eles publicam somente o suficiente para permitir aos leitores maravilharem-se do quanto eles foram capazes de fazer. Isto certamente é verdade em ciência da computação, onde o código fonte do programa relatado é normalmente secreto.

source: It Does Not Matter How Sharing Is Restricted
pt_br: Não Importa Como o Compartilhamento Seja Restringido

source: I have been discussing the effects of preventing people from copying, changing, and building on a program. I have not specified how this obstruction is carried out, because that doesn't affect the conclusion. Whether it is done by copy protection, or copyright, or licenses, or encryption, or <acronym title="Read-only Memory">ROM</acronym> cards, or hardware serial numbers, if it <em>succeeds</em> in preventing use, it does harm.
pt_br: Eu discuti os efeitos de evitar que as pessoas copiem, alterem e construam um programa. Eu não especifiquei como esta obstrução é feita, porque isto não afeta a conclusão. Não importa se é feita através de proteção contra cópia, copyright, licenças, criptografia, cartões <acronym title="Read-only Memory">ROM</acronym>, números seriais de hardware, se é bem <em>sucedido</em> então causa dano.

source: Users do consider some of these methods more obnoxious than others. I suggest that the methods most hated are those that accomplish their objective.
pt_br: Usuários consideram alguns destes métodos mais detestáveis que outros. Eu sugiro que os métodos mais odiados são aqueles que atingem seu objetivo.

source: Software Should be Free
pt_br: O Software Deveria ser Livre
