Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/shouldbefree.*.po
Languages: pt_br

source: Business ideology does not prepare people to resist the temptation to combat the competition. Some forms of combat have been banned with antitrust laws, truth in advertising laws, and so on, but rather than generalizing this to a principled rejection of combat in general, executives invent other forms of combat which are not specifically prohibited. Society's resources are squandered on the economic equivalent of factional civil war.
pt_br: Ideologia de negócios não prepara pessoas para resistir à tentação de combater na competição. Algumas formas de combate tem sido banidas com leis anti-truste, leis que exigem a verdade em anúncios, e assim por diante, mas em vez de generalizar isto para obter um princípio de rejeição ao combate em geral, executivos inventam outras formas de combate que não são especificamente proibidas. Os recursos da sociedade são gastos no equivalente econômico da guerra civil faccionária.

source: &ldquo;Why Don't You Move to Russia?&rdquo;
pt_br: “Porque Você Não Se Muda Pra Rússia?”

source: In the United States, any advocate of other than the most extreme form of laissez-faire selfishness has often heard this accusation. For example, it is leveled against the supporters of a national health care system, such as is found in all the other industrialized nations of the free world. It is leveled against the advocates of public support for the arts, also universal in advanced nations. The idea that citizens have any obligation to the public good is identified in America with Communism. But how similar are these ideas?
pt_br: Nos Estados Unidos, qualquer um que defenda outra coisa que não a mais extrema forma de política egoísta de não intervencionismo tem ouvido freqüentemente esta acusação. Por exemplo, é dito isso aos que defendem um sistema de saúde nacional, tal como os encontrado em todas as outras nações industrializadas do mundo livre. Também dizem isso aos que defendem o suporte público para as artes, também universal em nações desenvolvidas. A idéia que cidadãos tenham qualquer obrigação para com o bem público é identificada nos Estados Unidos como Comunismo. Mas quão similar são estas idéias?

source: Communism as was practiced in the Soviet Union was a system of central control where all activity was regimented, supposedly for the common good, but actually for the sake of the members of the Communist party. And where copying equipment was closely guarded to prevent illegal copying.
pt_br: Comunismo como praticado na União Soviética era um sistema de controle central onde toda atividade era regimentada, supostamente para o bem comum, mas na prática em pról dos membros do partido Comunista. E onde os equipamentos de cópia eram guardados herméticamente para evitar cópias ilegais.

source: The American system of software copyright exercises central control over distribution of a program, and guards copying equipment with automatic copying-protection schemes to prevent illegal copying.
pt_br: O sistema Americano de copyright exerce um controle central sobre a distribuição de um programa, e guarda os equipamentos de cópia com esquemas de proteção contra cópia automáticos para evitar a cópia ilegal.

source: By contrast, I am working to build a system where people are free to decide their own actions; in particular, free to help their neighbors, and free to alter and improve the tools which they use in their daily lives. A system based on voluntary cooperation and on decentralization.
pt_br: Em contraste, eu estou trabalhando para construir um sistema onde pessoas são livres para decidir suas própria ações; em particular, livres para ajudar seus companheiros, e livres para alterar e melhorar as ferramentas que elas usam no seu cotidiano. Um sistema baseado em cooperação voluntária e decentralização.

source: Thus, if we are to judge views by their resemblance to Russian Communism, it is the software owners who are the Communists.
pt_br: Assim, se nós temos que julgar pontos de vista pelas suas semelhanças com o Comunismo Russo, são os proprietários de software que são os Comunistas.

source: The Question of Premises
pt_br: A Questão das Premissas

source: I make the assumption in this paper that a user of software is no less important than an author, or even an author's employer. In other words, their interests and needs have equal weight, when we decide which course of action is best.
pt_br: Eu assumo neste documento que um usuário de software não é menos importante que um autor, ou até mesmo que o empregador de um autor. Em outras palavras, seus interesses e necessidades têm igual peso, quando nós decidimos que curso de ação é melhor.

source: This premise is not universally accepted. Many maintain that an author's employer is fundamentally more important than anyone else. They say, for example, that the purpose of having owners of software is to give the author's employer the advantage he deserves&mdash;regardless of how this may affect the public.
pt_br: Esta premissa não é universalmente aceita. Muitos mantém que um empregador de autor é fundamentalmente mais importante que qualquer um. Eles dizem, por exemplo, que o propósito de ter proprietários de software é dar ao empregador do autor a vantagem que ele merece — sem levar em consideração como isto pode afetar o público.

source: It is no use trying to prove or disprove these premises. Proof requires shared premises. So most of what I have to say is addressed only to those who share the premises I use, or at least are interested in what their consequences are. For those who believe that the owners are more important than everyone else, this paper is simply irrelevant.
pt_br: Não é comum tentar provar ou desaprovar estas premissas. Prova requer premissas compartilhadas. Sendo assim a maior parte do que eu disse é somente para aqueles que compartilham as premissas que eu adoto, ou pelo menos estão interessados em quais são suas conseqüências. Para aqueles que acreditam que os proprietários são mais importantes que todos os demais, este documento é irrelevante.

source: But why would a large number of Americans accept a premise that elevates certain people in importance above everyone else? Partly because of the belief that this premise is part of the legal traditions of American society. Some people feel that doubting the premise means challenging the basis of society.
pt_br: Mas porque um grande número de Americanos iria aceitar uma premissa que eleva certas pessoas em importância acima de todos os outros? Parcialmente por causa do credo que esta premissa é parte das tradições legais da sociedade Americana. Algumas pessoas sentem que duvidar da premissa significa desafiar as bases da sociedade.

source: It is important for these people to know that this premise is not part of our legal tradition. It never has been.
pt_br: É importante para estas pessoas saber que esta premissa não é parte da nossa tradição legal. Nem nunca foi.

source: Thus, the Constitution says that the purpose of copyright is to &ldquo;promote the Progress of Science and the useful Arts.&rdquo; The Supreme Court has elaborated on this, stating in <em>Fox Film v. Doyal</em>; that &ldquo;The sole interest of the United States and the primary object in conferring the [copyright] monopoly lie in the general benefits derived by the public from the labors of authors.&rdquo;
pt_br: Assim, a Constituição diz que o propósito do copyright é “promover o progresso da ciência e das artes úteis.” A Suprema Corte foi além disso, afirmando em <em>Fox Film vs. Doyal</em> que “O único interesse dos Estados Unidos e o principal objetivo em conferir o monopólio [de copyright] reside nos benefícios derivados pelo público a partir do trabalho dos autores.”

source: We are not required to agree with the Constitution or the Supreme Court. (At one time, they both condoned slavery.) So their positions do not disprove the owner supremacy premise. But I hope that the awareness that this is a radical right-wing assumption rather than a traditionally recognized one will weaken its appeal.
pt_br: Nós não temos que concordar com a Constituição ou com a Suprema Corte. (Uma vez, ambas perdoaram a escravidão.) Sendo assim suas posições não desaprovam a premissa da supremacia do proprietário. Mas eu espero que o anúncio que isto é uma concepção radical direitista em vez de uma tradicionalmente reconhecida venha enfraquecer seu apelo.

source: Conclusion
pt_br: Conclusão

source: We like to think that our society encourages helping your neighbor; but each time we reward someone for obstructionism, or admire them for the wealth they have gained in this way, we are sending the opposite message.
pt_br: Nós gostamos de pensar que nossa sociedade estimula o auxílio mútuo; mas cada vez que nós recompensamos alguém pelo seu obstrucionismo, ou o admiramos pela riqueza que ele ganhou deste modo, nós estamos enviando a mensagem oposta.

source: Software hoarding is one form of our general willingness to disregard the welfare of society for personal gain. We can trace this disregard from Ronald Reagan to Dick Cheney, from Exxon to Enron, from failing banks to failing schools. We can measure it with the size of the homeless population and the prison population. The antisocial spirit feeds on itself, because the more we see that other people will not help us, the more it seems futile to help them. Thus society decays into a jungle.
pt_br: O entesouramento de software é uma faceta da nossa disposição geral de desrespeitar o bem estar social em pról do ganho pessoal. Nós podemos vir acompanhando este desrespeito desde Ronald Reagan a Dick Cheney, desde Exxon a Enron, desde a falência dos bancos à falência das escolas. Podemos medir isto pelo tamanho da população sem-teto e da população carcerária. Este espírito anti-social alimenta a si mesmo; porque quanto mais nós vemos que outras pessoas não irão nos ajudar, mais nos parece fútil ajudá-las. Assim a sociedade vai decaindo até se tornar uma selva.

source: If we don't want to live in a jungle, we must change our attitudes. We must start sending the message that a good citizen is one who cooperates when appropriate, not one who is successful at taking from others. I hope that the free software movement will contribute to this: at least in one area, we will replace the jungle with a more efficient system which encourages and runs on voluntary cooperation.
pt_br: Se nós não queremos viver numa selva, devemos mudar nossas atitudes. Devemos começar enviando a mensagem que um bom cidadão é um que coopera quando apropriado, não um que é bem sucedido tirando dos outros. Eu espero que o movimento pelo software livre contribua para isto: pelo menos em uma área nós iremos substituir a selva por um sistema mais eficiente que encoraja e confia na cooperação voluntária.

source: Footnotes
pt_br: Notas de Rodapé

source: The word &ldquo;free&rdquo; in &ldquo;free software&rdquo; refers to freedom, not to price; the price paid for a copy of a free program may be zero, or small, or (rarely) quite large.
pt_br: A palavra “free” em “free software” refere-se à liberdade, e não ao preço. O preço pago por uma cópia de um “free software” pode ser zero, ou pequeno, ou (raramente) bem grande.

source: The issues of pollution and traffic congestion do not alter this conclusion. If we wish to make driving more expensive to discourage driving in general, it is disadvantageous to do this using toll booths, which contribute to both pollution and congestion. A tax on gasoline is much better. Likewise, a desire to enhance safety by limiting maximum speed is not relevant; a free-access road enhances the average speed by avoiding stops and delays, for any given speed limit.
pt_br: Os problemas da poluição e do congestionamento não alteram esta conclusão. Se nós desejamos tornar o ato de guiar mais caro para desencorajá-lo em geral, é desvantajoso fazer isto usando pedágios, que contribuem tanto para a poluição quanto para o congestionamento. Um imposto sobre a gasolina é muito melhor. Da mesma forma, um desejo de melhorar a segurança limitando a velocidade máxima não é relevante; a via de acesso livre melhora a velocidade média evitando paradas e atrasos, para qualquer limite de velocidade dado.

source: One might regard a particular computer program as a harmful thing that should not be available at all, like the Lotus Marketplace database of personal information, which was withdrawn from sale due to public disapproval. Most of what I say does not apply to this case, but it makes little sense to argue for having an owner on the grounds that the owner will make the program less available. The owner will not make it <em>completely</em> unavailable, as one would wish in the case of a program whose use is considered destructive.
pt_br: Alguém poderia observar que um programa de computador em particular é uma coisa prejudicial e que não deveria estar disponível, como a base de dados de informações pessoais Lotus Marketplace, que foi retirada de venda devido à desaprovação pública. A maior parte do que eu digo não se aplica a este caso, mas faz pouco sentido argumentar que seria bom ter um proprietário porque ele tornaria o programa menos disponível. O proprietário não o tornaria completamente não disponível, como seria desejável no caso de um programa cujo uso fosse considerado destrutivo.

source: This essay is published in <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Free Software, Free Society: The Selected Essays of Richard M. Stallman</cite></a>.
pt_br: Este ensaio foi publicado em <a href="http://shop.fsf.org/product/free-software-free-society/"><cite>Software Livre, Sociedade Livre: Artigos selecionados de Richard M. Stallman</cite></a>.

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: Copyright &copy; 1991, 1992, 1998, 2000, 2001, 2006, 2007, 2010 Free Software Foundation, Inc.
pt_br: Copyright &copy; 1991, 1992 Free Software Foundation, Inc.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
pt_br: Esta página está licenciada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.pt_BR">Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: traduzido por Juciê Dias Andrade

source: Updated:
pt_br: Última atualização:
