Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/shouldbefree.*.po
Languages: pt_br

source: Why Software Should Be Free - GNU Project - Free Software Foundation
pt_br: Porque o Software Deveria Ser Livre - Projeto GNU - Free Software Foundation

source: Why Software Should Be Free
pt_br: Porque o Software Deveria Ser Livre

source: by <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>
pt_br: por <a href="http://www.stallman.org/"><strong>Richard Stallman</strong></a>

source: Introduction
pt_br: Introdução

source: The existence of software inevitably raises the question of how decisions about its use should be made. For example, suppose one individual who has a copy of a program meets another who would like a copy. It is possible for them to copy the program; who should decide whether this is done? The individuals involved? Or another party, called the &ldquo;owner&rdquo;?
pt_br: A existência do software inevitavelmente levanta questões a respeito de como deveria ser feito seu uso. Por exemplo, suponha que um indivíduo que tem uma cópia de um programa se encontre com outro que gostaria de ter uma cópia. É possível a eles copiar o programa; quem deveria decidir se isto deve ser feito ou não? Os indivíduos envolvidos? Ou outra parte, chamada de “o proprietário”?

source: Software developers typically consider these questions on the assumption that the criterion for the answer is to maximize developers' profits. The political power of business has led to the government adoption of both this criterion and the answer proposed by the developers: that the program has an owner, typically a corporation associated with its development.
pt_br: Desenvolvedores de software tipicamente consideram estas questões assumindo que o critério para a resposta seja maximizar os lucros dos desenvolvedores. A força política do negócio tem levado à adoção, por parte do governo, tanto deste critério quanto da resposta proposta pelos desenvovedores: o programa tem um proprietário, tipicamente uma empresa associada ao seu desenvolvimento.

source: I would like to consider the same question using a different criterion: the prosperity and freedom of the public in general.
pt_br: Eu gostaria de considerar a mesma questão usando um critério diferente: a prosperidade e liberdade do público em geral.

source: This answer cannot be decided by current law&mdash;the law should conform to ethics, not the other way around. Nor does current practice decide this question, although it may suggest possible answers. The only way to judge is to see who is helped and who is hurt by recognizing owners of software, why, and how much. In other words, we should perform a cost-benefit analysis on behalf of society as a whole, taking account of individual freedom as well as production of material goods.
pt_br: Esta resposta não pode ser dada pela lei atual — a lei deveria agir em conformidade com a ética, não o contrário. Nem a prática comum decide esta questão, apesar de sugerir respostas possíveis. A única maneira de julgar é ver quem é beneficiado e quem é prejudicado pelo reconhecimento dos proprietários de software, porque, e quanto. Em outras palavras, nós deveríamos fazer uma análise de custo-benefício tomando por base a sociedade como um todo, levando em conta a liberdade individual bem como a produção de bens materiais.

source: In this essay, I will describe the effects of having owners, and show that the results are detrimental. My conclusion is that programmers have the duty to encourage others to share, redistribute, study, and improve the software we write: in other words, to write <a href="/philosophy/free-sw.html">&ldquo;free&rdquo; software</a>.<a href="#f1">(1)</a>
pt_br: Neste ensaio, eu irei descrever os efeitos de ter proprietários e mostrarei que os resultados são malignos. Minha conclusão é que programadores têm a responsabilidade de encorajar outros a compartilhar, redistribuir, estudar e melhorar o software que nós escrevemos: em outras palavras, escrever <a href="/philosophy/free-sw.html">software “livre”</a>.<a href="#f1">(1)</a>

source: How Owners Justify Their Power
pt_br: Como os Proprietários Justificam Seu Poder

source: Those who benefit from the current system where programs are property offer two arguments in support of their claims to own programs: the emotional argument and the economic argument.
pt_br: Aqueles que se beneficiam do sistema atual onde programas são propriedade oferecem dois argumentos em suporte à suas reivindicações: o argumento emocional e o econômico.

source: The emotional argument goes like this: &ldquo;I put my sweat, my heart, my soul into this program. It comes from <em>me</em>, it's <em>mine</em>!&rdquo;
pt_br: O argumento emocional é mais ou menos assim: “Eu coloquei meu suor, meu coração, minha alma neste programa. Ele veio de <em>mim</em>, é <em>meu</em>!”

source: This argument does not require serious refutation. The feeling of attachment is one that programmers can cultivate when it suits them; it is not inevitable. Consider, for example, how willingly the same programmers usually sign over all rights to a large corporation for a salary; the emotional attachment mysteriously vanishes. By contrast, consider the great artists and artisans of medieval times, who didn't even sign their names to their work. To them, the name of the artist was not important. What mattered was that the work was done&mdash;and the purpose it would serve. This view prevailed for hundreds of years.
pt_br: Este argumento não requer uma refutação pesada. O sentimento de ligação pode ser cultivado pelos programadores quando lhes convém; não é inevitável. Considere, por exemplo, quão sinceramente os mesmos programadores transferem todos os seus direitos à uma grande empresa em troca de um salário; a ligação emocional misteriosamente desaparece. Contrastando, considere os grandes artistas e artesãos dos tempos medievais, que nem mesmo assinavam seus nomes na sua obra. Para eles, o nome do artista não era importante. O que importava era que o trabalho havia sido feito — e o propósito ao qual ele serviria. Esta concepção prevaleceu durante séculos.

source: The economic argument goes like this: &ldquo;I want to get rich (usually described inaccurately as &lsquo;making a living&rsquo;), and if you don't allow me to get rich by programming, then I won't program. Everyone else is like me, so nobody will ever program. And then you'll be stuck with no programs at all!&rdquo; This threat is usually veiled as friendly advice from the wise.
pt_br: O argumento econômico se parece com: “Eu quero ficar rico (que via-de-regra é descrito imprecisamente como &lsquo;ganhar a vida&rsquo;), e se você não me permitir ficar rico programando, então eu não vou programar. Todos os outros são como eu, sendo assim ninguém mais vai programar. E então você vai acabar ficando sem programas!” Esta ameaça é normalmente velada, como um conselho de amigo.

source: I'll explain later why this threat is a bluff. First I want to address an implicit assumption that is more visible in another formulation of the argument.
pt_br: Depois eu irei explicar que esta ameaça é um blefe. Primeiro eu quero focar uma concepção que é mais visível em outra formulação do argumento.

source: This formulation starts by comparing the social utility of a proprietary program with that of no program, and then concludes that proprietary software development is, on the whole, beneficial, and should be encouraged. The fallacy here is in comparing only two outcomes&mdash;proprietary software versus no software&mdash;and assuming there are no other possibilities.
pt_br: Esta formulação começa comparando a utilidade social de um programa proprietário versus a da inexistência deste programa, e então conclui que o desenvolvimento de software proprietário é, no todo, benéfico e deveria ser encorajado. A falácia aqui está em comparar apenas dois pontos — software proprietário versus inexistência do software — e assumir que não existem outras possibilidades.

source: Given a system of software copyright, software development is usually linked with the existence of an owner who controls the software's use. As long as this linkage exists, we are often faced with the choice of proprietary software or none. However, this linkage is not inherent or inevitable; it is a consequence of the specific social/legal policy decision that we are questioning: the decision to have owners. To formulate the choice as between proprietary software versus no software is begging the question.
pt_br: Dado um sistema de copyright sobre programas, o desenvolvimento de software é comumente ligado à existência de um proprietário que controla o uso do software. Enquanto existe esta ligação, nós frequentemente nos deparamos com a opção entre software proprietário ou nada. No entanto, esta ligação não é natural ou inevitável; é uma conseqüência da escolha da política sócio-legal que nós estamos questionando: a decisão de ter proprietários. Formular a opção como sendo entre software proprietário versus software inexistente é desvirtuar a questão.

source: The Argument against Having Owners
pt_br: O Argumento Contra Ter Proprietários

source: The question at hand is, &ldquo;Should development of software be linked with having owners to restrict the use of it?&rdquo;
pt_br: A questão é: “O desenvolvimento de software deveria ser ligado a ter proprietários para restringir sua utilização?”

source: In order to decide this, we have to judge the effect on society of each of those two activities <em>independently</em>: the effect of developing the software (regardless of its terms of distribution), and the effect of restricting its use (assuming the software has been developed). If one of these activities is helpful and the other is harmful, we would be better off dropping the linkage and doing only the helpful one.
pt_br: Para que nós possamos escolher, nós temos que julgar o efeito na sociedade de cada uma destas duas atividades <em>independentemente</em>: o efeito de desenvolver software (sem levar em consideração seus termos de distribuição), e o efeito de restringir sua utilização (assumindo que o software tenha sido desenvolvido). Se uma destas atividades ajuda e a outra atrapalha, nós estaríamos melhor descartando esta ligação e fazendo apenas a atividade que ajuda.

source: To put it another way, if restricting the distribution of a program already developed is harmful to society overall, then an ethical software developer will reject the option of doing so.
pt_br: Colocando em outras palavras, se restringir a distribuição de um programa já desenvolvido é prejudicial à sociedade como um todo, então um desenvolvedor ético irá rejeitar a opção de trabalhar deste modo.

source: To determine the effect of restricting sharing, we need to compare the value to society of a restricted (i.e., proprietary) program with that of the same program, available to everyone. This means comparing two possible worlds.
pt_br: Para determinar o efeito de restringir o compartilhamento, nós precisamos comparar o valor para a sociedade de um programa restrito (por exemplo proprietário) com o valor do mesmo programa, disponível para todos. Isto significa comparar dois mundos possíveis.

source: This analysis also addresses the simple counterargument sometimes made that &ldquo;the benefit to the neighbor of giving him or her a copy of a program is cancelled by the harm done to the owner.&rdquo; This counterargument assumes that the harm and the benefit are equal in magnitude. The analysis involves comparing these magnitudes, and shows that the benefit is much greater.
pt_br: Esta análise também leva em consideração o o contra-argumento feito às vezes que “o benefício ao próximo de lhe dar uma cópia de um programa é cancelado pelo dano feito ao proprietário.” Este contra-argumento assume que o dano e o benefício são de igual grandeza. A análise envolve comparar estas duas grandezas, e mostra que os benefícios são muito maiores.

source: To elucidate this argument, let's apply it in another area: road construction.
pt_br: Para elucidar este argumento, vamos aplicá-lo a outra área: construção de vias públicas.

source: It would be possible to fund the construction of all roads with tolls. This would entail having toll booths at all street corners. Such a system would provide a great incentive to improve roads. It would also have the virtue of causing the users of any given road to pay for that road. However, a toll booth is an artificial obstruction to smooth driving&mdash;artificial, because it is not a consequence of how roads or cars work.
pt_br: Seria possível financiar a construção de todas as vias com pedágios. Isto iria exigir que houvesse postos de cobrança de pedágio em todas as esquinas. Tal sistema produziria um grande incentivo para melhorar as estradas. Teria também a virtude de fazer com que os usuários de qualquer estrada pagassem por ela. No entanto, um posto de cobrança de pedágio é um obstáculo artificial à condução suave de um veículo — artificial porque não é uma conseqüência de como estradas ou carros funcionam.

source: Comparing free roads and toll roads by their usefulness, we find that (all else being equal) roads without toll booths are cheaper to construct, cheaper to run, safer, and more efficient to use.<a href="#f2">(2)</a> In a poor country, tolls may make the roads unavailable to many citizens. The roads without toll booths thus offer more benefit to society at less cost; they are preferable for society. Therefore, society should choose to fund roads in another way, not by means of toll booths. Use of roads, once built, should be free.
pt_br: Comparando a utilidade das estradas gratuitas com a utilidade das estradas onde há cobrança de pedágio, nós concluímos que (sendo igual todo o restante) estradas sem pedágio são mais baratas de construir, mais baratas para se usar, mais seguras e mais eficientes.(2) Em uma nação pobre, pedágios podem tornar as estradas proibitivas para muitos cidadãos. As estradas sem pedágio oferecem assim mais benefícios à sociedade a um custo menor; elas são preferíveis para a sociedade. Sendo assim, a sociedade deveria se decidir por financiar as estradas de outra maneira, e não por meio de pedágio. O uso das estradas, uma vez contruídas, deveria ser gratuito.

source: When the advocates of toll booths propose them as <em>merely</em> a way of raising funds, they distort the choice that is available. Toll booths do raise funds, but they do something else as well: in effect, they degrade the road. The toll road is not as good as the free road; giving us more or technically superior roads may not be an improvement if this means substituting toll roads for free roads.
pt_br: Quando os defensores dos pedágios os propõem meramente como um modo de levantar fundos, eles distorcem a opção que é disponível. Pedágios arrecadam fundos, mas eles fazem algo além disso: em efeito, eles degradam a estrada, no sentido de que a estrada com pedágio não é tão boa quanto a gratuita; nos fornecer estradas em maior quantidade ou técnicamente superiores pode não ser uma melhoria se isto significa subsituir as vias gratuitas pelas vias com pedágio.

source: Of course, the construction of a free road does cost money, which the public must somehow pay. However, this does not imply the inevitability of toll booths. We who must in either case pay will get more value for our money by buying a free road.
pt_br: É claro que a construção de uma estrada sem pedágio custa dinheiro, que o público deve pagar de algum modo. No entanto, isto não implica necessariamente na existência de postos de pedágio. Nós, que em qualquer dos casos estaremos pagando, faremos melhor negócio adquirindo uma estrada livre de pedágio.

source: I am not saying that a toll road is worse than no road at all. That would be true if the toll were so great that hardly anyone used the road&mdash;but this is an unlikely policy for a toll collector. However, as long as the toll booths cause significant waste and inconvenience, it is better to raise the funds in a less obstructive fashion.
pt_br: Eu não estou aqui dizendo que uma estrada com pedágio é pior que ficar sem estrada. Isto seria verdade se a tarifa fosse tão alta que dificilmente alguém usasse a estrada — mas isto é uma política pouco provável para um arrecadador de impostos. No entanto, uma vez que os pedágios causem um desperdício e inconveniência significativos, é melhor levantar fundos de um modo menos perturbador.

source: To apply the same argument to software development, I will now show that having &ldquo;toll booths&rdquo; for useful software programs costs society dearly: it makes the programs more expensive to construct, more expensive to distribute, and less satisfying and efficient to use. It will follow that program construction should be encouraged in some other way. Then I will go on to explain other methods of encouraging and (to the extent actually necessary) funding software development.
pt_br: Para aplicar o mesmo argumento ao desenvolvimento de software, eu irei agora mostrar que ter “pedágios” para programas úteis custa diariamente à sociedade: torna os programas mais caros para construir, mais caros para distribuir, e menos satifatórios e eficientes para se usar. Segue que a construção de programas deveria ser encorajada de algum outro modo. Então eu irei explicar outros métodos de estímulo e (à medida do realmente necessário) financiamento para o desenvolvimento de software.

source: The Harm Done by Obstructing Software
pt_br: O Dano Causado por Software Obstruído

source: Consider for a moment that a program has been developed, and any necessary payments for its development have been made; now society must choose either to make it proprietary or allow free sharing and use. Assume that the existence of the program and its availability is a desirable thing.<a href="#f3">(3)</a>
pt_br: Considere por um momento que um programa tenha sido desenvolvido, e que qualquer pagamentos necessários para seu desenvolvimento já tenham sido feitos; agora a sociedade tem que decidir se deve torná-lo proprietário ou se deve permitir seu livre uso e compartilhamento. Assuma que é desejável que o programa exista e que esteja disponível.<a href="#f3">(3)</a>

source: Restrictions on the distribution and modification of the program cannot facilitate its use. They can only interfere. So the effect can only be negative. But how much? And what kind?
pt_br: Restrições na distribuição e modificação do programa não podem facilitar seu uso. Só podem interferir. Sendo assim o efeito só pode ser negativo. Mas quão negativo? E de que modo?

source: Three different levels of material harm come from such obstruction:
pt_br: Três níveis diferentes de danos materiais se originam desta obstrução:

source: Fewer people use the program.
pt_br: Menos pessoas usam o programa.

source: None of the users can adapt or fix the program.
pt_br: Nenhum dos usuários pode adaptar ou corrigir o programa.

source: Other developers cannot learn from the program, or base new work on it.
pt_br: Outros desenvolvedores não podem aprender a partir do programa, ou basear um novo trabalho nele.

source: Each level of material harm has a concomitant form of psychosocial harm. This refers to the effect that people's decisions have on their subsequent feelings, attitudes, and predispositions. These changes in people's ways of thinking will then have a further effect on their relationships with their fellow citizens, and can have material consequences.
pt_br: Cada nível de dano material tem uma forma concomitante de dano psico-social. Isto se refere ao efeito que as decisões das pessoas tem nos seus sentimentos, atitudes e predisposições subseqüentes. Estas alterações na maneira de pensar das pessoas terão um efeito posterior no seu relacionamento com seus co-cidadãos e podem ter conseqüências materiais.

source: The three levels of material harm waste part of the value that the program could contribute, but they cannot reduce it to zero. If they waste nearly all the value of the program, then writing the program harms society by at most the effort that went into writing the program. Arguably a program that is profitable to sell must provide some net direct material benefit.
pt_br: Os três níveis de danos materiais desperdiçam parte do valor que o programa poderia prover, mas eles não podem reduzí-lo a zero. Se eles desperdiçassem quase todo o valor do programa, então o programa causaria quase tanto dano à sociedade quanto o esforço empregado para escrevê-lo. Pode-se dizer que um programa que é lucrativo deveria prover algum benefício material líquido direto.

source: However, taking account of the concomitant psychosocial harm, there is no limit to the harm that proprietary software development can do.
pt_br: No entanto, levando em consideração o dano pico-social concomitante, não existe limite para os danos que o desenvolvimento de software proprietário pode causar.

source: Obstructing Use of Programs
pt_br: Obstruindo O Uso de Programas

source: The first level of harm impedes the simple use of a program. A copy of a program has nearly zero marginal cost (and you can pay this cost by doing the work yourself), so in a free market, it would have nearly zero price. A license fee is a significant disincentive to use the program. If a widely useful program is proprietary, far fewer people will use it.
pt_br: O primeiro nível de dano impede o simples uso de um programa. Uma cópia de um programa tem um custo marginal de quase zero (e você pode pagar este custo executando você mesmo a tarefa), sendo assim, num mercado livre, teria um preço de quase zero. Uma taxa de licença é um desincentivo significativo ao uso do programa. Se um programa de ampla utilidade é proprietário, muito menos pessoas irão utilizá-lo.

source: It is easy to show that the total contribution of a program to society is reduced by assigning an owner to it. Each potential user of the program, faced with the need to pay to use it, may choose to pay, or may forego use of the program. When a user chooses to pay, this is a zero-sum transfer of wealth between two parties. But each time someone chooses to forego use of the program, this harms that person without benefiting anyone. The sum of negative numbers and zeros must be negative.
pt_br: É fácil mostrar que a contribuição total de um programa para a sociedade é reduzida atribuindo-se um proprietário a ele. Cada usuário potencial do programa, deparado com a necessidade de pagar para utilizá-lo, pode escolher pagar ou pode abrir mão do seu uso. Quando um usuário escolhe pagar, isto é uma transferência de riqueza entre duas partes. Mas cada vez que alguém escolhe abrir mão de usar o programa, isto causa um dano àquela pessoa sem beneficiar ninguém. A soma dos números negativos e zeros deve ser negativa.

source: But this does not reduce the amount of work it takes to <em>develop</em> the program. As a result, the efficiency of the whole process, in delivered user satisfaction per hour of work, is reduced.
pt_br: Mas isto não reduz o montante de trabalho que é necessário para desenvolver o programa. Como resultado, é reduzida a eficiência do processo como um todo, em termos da satisfação de usuário proporcionada por hora de trabalho.
