Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/the-danger-of-ebooks.*.po
Languages: pt_br

source: The Danger of E-Books - GNU Project - Free Software Foundation
pt_br: O perigo dos e-books - Projeto GNU - Free Software Foundation

source: The Danger of E-Books
pt_br: O perigo dos e-books

source: <a href="http://defectivebydesign.org/ebooks.html">Join our mailing list about the dangers of eBooks</a>.
pt_br: <a href="http://defectivebydesign.org/ebooks.html">Junte-se à nossa lista de e-mails sobre os perigos dos e-books</a>.

source: In an age where business dominates our governments and writes our laws, every technological advance offers business an opportunity to impose new restrictions on the public. Technologies that could have empowered us are used to chain us instead.
pt_br: Em uma época na qual empresas dominam nossos governos e escrevem nossas leis, cada avanço tecnológico oferece às empresas uma oportunidade para impor novas restrições ao público. Tecnologias que poderiam nos dar poder são usadas, ao contrário, para nos acorrentar.

source: With printed books,
pt_br: Com livros impressos,

source: You can buy one with cash, anonymously.
pt_br: Você pode comprar um com dinheiro, anonimamente.

source: Then you own it.
pt_br: Então, você tem a posse dele.

source: You are not required to sign a license that restricts your use of it.
pt_br: Você não precisa assinar uma licença que restringe o seu uso dele.

source: The format is known, and no proprietary technology is needed to read the book.
pt_br: O formato é conhecido, e nenhuma tecnologia proprietária é necessária para ler o livro.

source: You can give, lend or sell the book to another.
pt_br: Você pode dar, emprestar ou vender o livro a alguém.

source: You can, physically, scan and copy the book, and it's sometimes lawful under copyright.
pt_br: Você pode, fisicamente, digitalizar e copiar o livro, e isso em alguns casos é permitido pela lei de direitos autorais.

source: Nobody has the power to destroy your book.
pt_br: Ninguém tem o poder de destruir o seu livro.

source: Contrast that with Amazon e-books (fairly typical):
pt_br: Contraste isso com os e-books da Amazon (que são bem típicos):

source: Amazon requires users to identify themselves to get an e-book.
pt_br: Amazon requer que os usuários se identifiquem para obter um e-book.

source: In some countries, including the US, Amazon says the user cannot own the e-book.
pt_br: Em alguns países, nos EUA inclusive, a Amazon diz que o usuário não pode possuir o e-book.

source: Amazon requires the user to accept a restrictive license on use of the e-book.
pt_br: A Amazon requer que o usuário aceite uma licença restritiva sobre o uso do e-book.

source: The format is secret, and only proprietary user-restricting software can read it at all.
pt_br: O formato é secreto e somente software proprietário, restritivo aos usuários, é capaz de lê-lo.

source: An ersatz &ldquo;lending&rdquo; is allowed for some books, for a limited time, but only by specifying by name another user of the same system. No giving or selling.
pt_br: Um substituto inferior do “empréstimo” é permitido para alguns livros por um tempo limitado, mas somente especificando-se pelo nome algum outro usuário do mesmo sistema. Não é permitido dar ou vender.

source: To copy the e-book is impossible due to <a href="/philosophy/right-to-read.html">Digital Restrictions Management</a> in the player and prohibited by the license, which is more restrictive than copyright law.
pt_br: Copiar o e-book é impossível devido à <a href="/philosophy/right-to-read.html">Gestão Digital de Restrições</a> no leitor de e-books, além de ser proibido pela licença, que é mais restritiva do que a lei de direitos autorais.

source: Amazon can remotely delete the e-book using a back door. It used this back door in 2009 to delete thousands of copies of George Orwell's 1984.
pt_br: A Amazon pode apagar o e-book remotamente à distância, usando um back door<sup><a href="#TransNote1">1</a></sup>. Ela fez uso disso em 2009, para deletar milhares de cópias de “1984”, de George Orwell.

source: Even one of these infringements makes e-books a step backward from printed books. We must reject e-books until they respect our freedom.
pt_br: Cada uma dessas infrações coloca os e-books um passo atrás em relação aos livros impressos. Precisamos rejeitar os e-books até que eles respeitem a nossa liberdade.

source: The e-book companies say denying our traditional freedoms is necessary to continue to pay authors. The current copyright system supports those companies handsomely and most authors badly. We can support authors better in other ways that don't require curtailing our freedom, and even legalize sharing. Two methods I've suggested are:
pt_br: As companhias de e-books dizem que negar nossas liberdades tradicionais é necessário para continuar a pagar os autores. O sistema atual de direitos autorais auxiliam generosamente essas companhias, e de maneira ruim a maioria dos autores. Nós podemos apoiar melhor os autores de outras maneiras que não requeiram reduzir nossa liberdade e podem até mesmo mesmo legalizar o compartilhamento. Dois métodos que tenho sugerido são:

source: To distribute tax funds to authors based on the cube root of each author's popularity. See <a href="http://stallman.org/articles/internet-sharing-license.en.html"> http://stallman.org/articles/internet-sharing-license.en.html</a>.
pt_br: Distribuir fundos de impostos a autores com base na raíz cúbica da popularidade de cada autor. Veja <a href="http://stallman.org/articles/internet-sharing-license.en.html">http://stallman.org/articles/internet-sharing-license.en.html</a>.

source: To design players so users can send authors anonymous voluntary payments.
pt_br: Projetar leitores de e-books de modo que os usuários possam enviar pagamentos voluntários anônimos aos autores.

source: E-books need not attack our freedom (Project Gutenberg's e-books don't), but they will if companies get to decide. It's up to us to stop them.
pt_br: E-books não precisam atacar nossa liberdade (os e-books do Projeto Gutenberg não atacam), mas eles o farão se a decisão ficar nas mãos das companhias. Cabe a nós impedi-las.

source: Join the fight: sign up at <a href="http://DefectiveByDesign.org/ebooks.html"> http://DefectiveByDesign.org/ebooks.html</a>.
pt_br: Junte-se à luta: subscreva-se em <a href="http://DefectiveByDesign.org/ebooks.html">http://DefectiveByDesign.org/ebooks.html</a>.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
pt_br: <h3>Notas do tradutor</h3> <ol> <li id="TransNote1">O termo <em>back door</em> (em português, “porta dos fundos”) se refere a um recurso utilizado para ganhar acesso a um computador ou outro sistema sem a autorização do seu dono ou administrador.</li> </ol>

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: Nós trabalhamos arduamente para oferecer traduções precisas e de boa qualidade. No entanto, não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>.</p> <p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
pt_br: Esta página está licenciada com uma Licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: <b>Tradução:</b> Hudson Lacerda, 2014

source: Updated:
pt_br: Última atualização:
