Repository: gitGNU/gnu_www-pt-br
Catalog: philosophy/who-does-that-server-really-serve.*.po
Languages: pt_br

source: Who Does That Server Really Serve? - GNU Project - Free Software Foundation
pt_br: A Quem Aquele Servidor Realmente Serve? - Projeto GNU - Free Software Foundation

source: Who does that server really serve?
pt_br: A quem aquele servidor realmente serve?

source: by <strong>Richard Stallman</strong>
pt_br: por <strong>Richard Stallman</strong>

source: (The first version was published in <a href="http://www.bostonreview.net/richard-stallman-free-software-DRM"> Boston Review</a>.)
pt_br: (A primeira versão foi publicada no <a href="http://bostonreview.net/BR35.2/stallman.php">Boston Review</a>.)

source: <strong>On the Internet, proprietary software isn't the only way to lose your freedom. Service as a Software Substitute, or SaaSS, is another way to let someone else have power over your computing.</strong>
pt_br: <strong>Na internet, software proprietário não é a única maneira de você perder a sua liberdade. Serviço como Substituto de Software [Service as a Software Substitute], ou SaaSS, é outra forma de deixar que alguém tenha poder sobre sua computação.</strong>

source: Background: How Proprietary Software Takes Away Your Freedom
pt_br: Plano de fundo: Como o Software Proprietário Toma a Sua Liberdade

source: Digital technology can give you freedom; it can also take your freedom away. The first threat to our control over our computing came from <em>proprietary software</em>: software that the users cannot control because the owner (a company such as Apple or Microsoft) controls it. The owner often takes advantage of this unjust power by inserting malicious features such as spyware, back doors, and <a href="http://DefectiveByDesign.org">Digital Restrictions Management (DRM)</a> (referred to as &ldquo;Digital Rights Management&rdquo; in their propaganda).
pt_br: Tecnologia digital pode dar a você liberdade; ela também pode tomar a sua liberdade. A primeira ameaça ao nosso controle sobre a nossa computação veio do <em>software proprietário</em>: software que os usuários não podem controlar, porque o fabricante (uma empresa como a Apple ou a Microsoft) o controla. O dono com frequência tira vantagem desse poder injusto, inserindo funcionalidades maliciosas tais como spyware, back doors e <a href="http://DefectiveByDesign.org">Gestão Digital de Restrições (DRM)</a> (referenciado como &ldquo;Gestão de Direitos Digitais&rdquo; [&ldquo;Digital Rights Management&rdquo;] nas suas propagandas).

source: Our solution to this problem is developing <em>free software</em> and rejecting proprietary software. Free software means that you, as a user, have four essential freedoms: (0)&nbsp;to run the program as you wish, (1)&nbsp;to study and change the source code so it does what you wish, (2)&nbsp;to redistribute exact copies, and (3)&nbsp;to redistribute copies of your modified versions. (See the <a href="/philosophy/free-sw.html">free software definition</a>.)
pt_br: Nossa solução para este problema é o desenvolvimento de <em>software livre</em> e a rejeição de software proprietário. Software livre significa que você, como um usuário, tem quatro liberdades essenciais: (0)&nbsp;de executar o programa como você desejar, (1)&nbsp;de estudar e alterar o código fonte para que ele faça o que você desejar, (2)&nbsp;de redistribuir cópias exatas e (3)&nbsp;de redistribuir cópias de suas versões modificadas. (Veja a <a href="/philosophy/free-sw.html">definição de software livre</a>.)

source: With free software, we, the users, take back control of our computing. Proprietary software still exists, but we can exclude it from our lives and many of us have done so. However, we now face a new threat to our control over our computing: Service as a Software Substitute (SaaSS). For our freedom's sake, we have to reject that too.
pt_br: Com software livre, nós, os usuários, tomamos de volta o controle sobre nossa computação. Software proprietário ainda existe, mas nós podemos excluí-lo de nossas vidas, e muitos de nós já o fizemos. Porém, agora estamos face-a-face com uma nova ameaça ao controle de nossa computação: Serviço como Substituto de Software (SaaSS). Para o bem de nossa liberdade, temos que rejeitar isso também.

source: The computing is <em>her own</em> because, by assumption, she could, in principle, have done it by running a program on her own computer (whether or not that program is available to her at present). When this assumption is not so, it isn't SaaSS.
pt_br: A computação é <em>do próprio usuário</em> porque supõe-se que, em princípio, ele poderia tê-la realizado usando um programa em seu próprio computador (independentemente de o programa estar ou não disponível para ele no momento). Quando essa suposição não se aplica, não se trata de SaaSS.

source: With SaaSS, the users do not have even the executable file that does their computing: it is on someone else's server, where the users can't see or touch it. Thus it is impossible for them to ascertain what it really does, and impossible to change it.
pt_br: Com SaaSS, os usuários não têm nem mesmo o arquivo executável que realiza sua computação: ele está no servidor de outra pessoa, onde os usuários não podem vê-lo nem tocá-lo. Portanto, é impossível para eles ter certeza do que o programa realmente faz, e é impossível modificá-lo.

source: Furthermore, SaaSS automatically leads to consequences equivalent to the malicious features of certain proprietary software.
pt_br: Além do mais, SaaSS automaticamente leva a consequencias equivalentes aos recursos maliciosos de certos programas proprietários.

source: Some proprietary operating systems have a universal back door, permitting someone to remotely install software changes. For instance, Windows has a universal back door with which Microsoft can forcibly change any software on the machine. Nearly all portable phones have them, too. Some proprietary applications also have universal back doors; for instance, the Steam client for GNU/Linux allows the developer to remotely install modified versions.
pt_br: Alguns sistemas operacionais proprietários têm uma porta dos fundos [back door] universal, permitindo que alguém possa, remotamente, instalar alterações nos programas. Por exemplo, Windows tem uma porta dos fundos universal com a qual a Microsoft pode alterar à força qualquer software naquela máquina. Praticamente todos os telefones portáteis as têm, também. Algumas aplicações proprietárias também têm portas dos fundos universais: por exemplo, o cliente Steam para GNU/Linux permite ao desenvolvedor instalar versões modificadas à distância.

source: With SaaSS, the server operator can change the software in use on the server. He ought to be able to do this, since it's his computer; but the result is the same as using a proprietary application program with a universal back door: someone has the power to silently impose changes in how the user's computing gets done.
pt_br: Com SaaSS, o operador do servidor pode modificar o software usado no servidor. Ele tem que ser capaz de fazer isso, já que o computador é dele; mas o resultado [para o usuário] é o mesmo que usar programa aplicativo proprietário com uma porta dos fundos universal: alguém tem o poder de, silenciosamente, impor mudanças no modo com que a computação do usuário é feita.

source: SaaSS and SaaS
pt_br: SaaSS e SaaS

source: Originally we referred to this problematical practice as &ldquo;SaaS&rdquo;, which stands for &ldquo;Software as a Service&rdquo;. It's a commonly used term for setting up software on a server rather than offering copies of it to users, and we thought it described precisely the cases where this problem occurs.
pt_br: Originalmente, nós nos referíamos a essa prática problemática como &ldquo;SaaS&rdquo;, que significa Software como Serviço [&ldquo;Software as a Service&rdquo;]. Trata-se de um termo comumente usado para a configuração de software em um servidor, ao invés da oferta de cópias dele aos usuários, e nós pensávamos que esse termo descrevia com precisão os casos em que esse problema ocorre.

source: Subsequently we became aware that the term SaaS is sometimes used for communication services&mdash;activities for which this issue is not applicable. In addition, the term &ldquo;Software as a Service&rdquo; doesn't explain <em>why</em> the practice is bad. So we coined the term &ldquo;Service as a Software Substitute&rdquo;, which defines the bad practice more clearly and says what is bad about it.
pt_br: Subsequentemente, tomamos consciência de que o termo SaaS algumas vezes é usado para serviços de comunicação &mdash; atividades em que essa questão não se aplica. Adicionalmente, o termo &ldquo;Software como Serviço&rdquo; não explica <em>por que</em> a prática é ruim. Então, nós cunhamos o termo &ldquo;Serviço como Substituto de Software&rdquo; [&ldquo;Service as a Software Substitute&rdquo;], que define a má prática mais claramente e diz o que é ruim nela.

source: Untangling the SaaSS Issue from the Proprietary Software Issue
pt_br: Separando a Questão do SaaSS da Questão do Software Proprietário

source: Releasing the server software source code does benefit the community: it enables suitably skilled users to set up similar servers, perhaps changing the software. <a href="/licenses/license-recommendations.html"> We recommend using the GNU Affero GPL</a> as the license for programs often used on servers.
pt_br: Liberar o código fonte de software para servidor beneficia a comunidade: isso permite que usuários com as habilidades adequadas configurem servidores similares, possivelmente alterando o software. <a href="/licenses/license-recommendations.html">Recomendamos o uso da GNU Affero GPL</a> como a licença para programas frequentemente usados em servidores.

source: But none of these servers would give you control over computing you do on it, unless it's <em>your</em> server. It may be OK to trust your friend's server for some jobs, just as you might let your friend maintain the software on your own computer. Outside of that, all these servers would be SaaSS for you. SaaSS always subjects you to the power of the server operator, and the only remedy is, <em>Don't use SaaSS!</em> Don't use someone else's server to do your own computing on data provided by you.
pt_br: Mas nenhum daqueles servidores daria a você o controle sobre a computação que você faz nele, a não ser que seja o <em>seu</em> servidor. Pode ser aceitável confiar algumas tarefas a servidores de amigos seus, assim como você poderia deixar um amigo seu configurar os programas de seu próprio computador. Fora isso, todos aqueles servidores serão SaaSS para você. SaaSS sempre lhe sujeita ao poder do operador do servidor, e o único remédio é: <em>Não use SaaSS!</em> Não use um servidor alheio para fazer suas próprias atividades computacionais sobre dados fornecidos por você.

source: Services are fundamentally different from programs, and the ethical issues that services raise are fundamentally different from the issues that programs raise. To avoid confusion, we <a href="/philosophy/network-services-arent-free-or-nonfree.html"> avoid describing a service as &ldquo;free&rdquo; or &ldquo;proprietary.&rdquo;</a>
pt_br: Serviços são fundamentalmente diferentes de programas, e as questões éticas que serviços levantam são fundamentalmente diferentes das questões que programas levantam. Para evitar confusão, <a href="/philosophy/network-services-arent-free-or-nonfree.html">evitamos descrever algum serviço como &ldquo;livre&rdquo; ou &ldquo;proprietário.&rdquo;</a>

source: Which online services are SaaSS? The clearest example is a translation service, which translates (say) English text into Spanish text. Translating a text for you is computing that is purely yours. You could do it by running a program on your own computer, if only you had the right program. (To be ethical, that program should be free.) The translation service substitutes for that program, so it is Service as a Software Substitute, or SaaSS. Since it denies you control over your computing, it does you wrong.
pt_br: Quais serviços são SaaSS? O exemplo mais claro é um serviço de tradução, que traduz (digamos) um texto de inglês para espanhol. A tradução de um texto para você é uma tarefa computacional que é puramente sua. Você poderia realizá-la rodando um programa em seu próprio computador, se você simplesmente tivesse o programa certo. (Para ser ético, esse programa deve ser livre.) O serviço de tradução substitui esse programa, então trata-se de Serviço como Substituto de Software, ou SaaSS. Por lhe negar o controle de sua própria computação, ele é ruim para você.

source: Another clear example is using a service such as Flickr or Instagram to modify a photo. Modifying photos is an activity that people have done in their own computers for decades; doing it in a server instead of your own computer is SaaSS.
pt_br: Outro exemplo claro é o uso de um serviço como Flickr ou Instagram para modificar uma foto. Modificar fotos é uma atividade que as pessoas têm feito em seus próprios computadores ao longo de décadas; fazê-la em um servidor, ao invés de em seru próprio computador é SaaSS.

source: In its essence, social networking is a form of communication and publication, not SaaSS. However, a service whose main facility is social networking can have features or extensions which are SaaSS.
pt_br: Na sua essência, as redes sociais digitais são uma forma de comunicação e publicação, não SaaSS. Entretanto, um serviço cuja principal função é a de rede social pode ter recursos e extensões que são SaaSS.

source: If a service is not SaaSS, that does not mean it is OK. There are other ethical issues about services. For instance, Facebook distributes video in Flash, which pressures users to run nonfree software; it requires running nonfree JavaScript code; and it gives users a misleading impression of privacy while luring them into baring their lives to Facebook. Those are important issues, different from the SaaSS issue.
pt_br: Se um serviço não é SaaSS, isso não significa que ele esteja OK. Há outras questões éticas sobre serviços. Por exemplo, Facebook distribui vídeo em Flash, o que pressiona o usuário a usar software não livre; o Facebook também requer a execução de código JavaScript não livre; e ele dá aos usuários uma impressão enganosa de privacidade, enquanto os induz a desnudar suas vidas para o Facebook. Essas são questões importantes, diversas da questão do SaaSS.

source: Repository sites such as as Savannah and SourceForge are not inherently SaaSS, because a repository's job is publication of data supplied to it.
pt_br: Sítio de repositórios tais como Savannah e SourceForge não são inerentemente SaaSS, porque a tarefa de um repositório é publicar os dados a ele fornecidos.

source: Google Docs shows how complex the evaluation of a single service can become. It invites people to edit a document by running a large <a href="/philosophy/javascript-trap.html">nonfree JavaScript program</a>, clearly wrong. However, it offers an API for uploading and downloading documents in standard formats. A free software editor can do so through this API. This usage scenario is not SaaSS, because it uses Google Docs as a mere repository. Showing all your data to a company is bad, but that is a matter of privacy, not SaaSS; depending on a service for access to your data is bad, but that is a matter of risk, not SaaSS. On the other hand, using the service for converting document formats <em>is</em> SaaSS, because it's something you could have done by running a suitable program (free, one hopes) in your own computer.
pt_br: Google Docs mostra o quão complexa pode se tornar a avaliação de um único serviço. Ele convida pessoas a editarem um documento através da execução de um enorme <a href="/philosophy/javascript-trap.html">programa JavaScript não livre</a>, claramente mau. Contudo, oferece uma API para <em>upload</em> e <em>download</em> de documentos em formatos padrão. Um software editor livre pode fazer isso usando essa API. Esse cenário de uso não é SaaSS, porque usa Google Docs como um mero repositório. Mostrar todos os seus dados para uma companhia é ruim, mas isso é um problema de privacidade, não de SaaSS; depender de um serviço para acessar seus próprios dados é mau, porém é um problema de risco, não de SaaSS. Por outro lado, usar o serviço para converter documentos de um formato a outro <em>é</em> SaaSS, porque é algo que poderia ser feito rodando um programa adequado (livre, espera-se) em seu próprio computador.

source: Using Google Docs through a free editor is rare, of course. Most often, people use it through the nonfree JavaScript program, which is bad like any nonfree program. This scenario might involve SaaSS, too; that depends on what part of the editing is done in the JavaScript program and what part in the server. We don't know, but since SaaSS and proprietary software do similar wrong to the user, it is not crucial to know.
pt_br: Usar Google Docs através de um editor livre é raro, é claro. Mais frequentemente, as pessoas o usam através do programa JavaScript não livre, que é tão ruim quanto qualquer programa não livre. Esse cenário poderia envolver SaaSS, também; isso vai depender de que parte da edição é feita no programa JavaScript e que parte é feita no servidor. Não sabemos como isso é feito, mas, desde que SaaSS e software proprietário causam males parecidos ao usuário, não é crucial saber como.

source: Publishing via someone else's repository does not raise privacy issues, but publishing through Google Docs has a special problem: it is impossible even to <em>view the text</em> of a Google Docs document in a browser without running the nonfree JavaScript code. Thus, you should not use Google Docs to publish anything&mdash;but the reason is not a matter of SaaSS.
pt_br: A publicação através do repositório de outra pessoa não levanta problemas de privacidade, mas publicar através do Google Docs tem um problema especial: é impossível até mesmo <em>ver o texto</em> de um documento no Google Docs em um navegador, sem rodar o código JavaScript não livre. Então, você não deve usar Google Docs para publicar nada &mdash; mas a razão não é um assunto de SaaSS.

source: Dealing with the SaaSS Problem
pt_br: Lidando com o Problema do SaaSS

source: Only a small fraction of all web sites do SaaSS; most don't raise the issue. But what should we do about the ones that raise it?
pt_br: Somente uma pequena fração de todos os sítios web fazem SaaSS; a maioria não apresenta esse problema. Mas o que nós devemos fazer quanto àqueles que o apresentam?

source: However, on a longer time scale, we can create alternatives to using servers. For instance, we can create a peer-to-peer program through which collaborators can share data encrypted. The free software community should develop distributed peer-to-peer replacements for important &ldquo;web applications&rdquo;. It may be wise to release them under the <a href="/licenses/why-affero-gpl.html"> GNU Affero GPL</a>, since they are likely candidates for being converted into server-based programs by someone else. The <a href="/">GNU project</a> is looking for volunteers to work on such replacements. We also invite other free software projects to consider this issue in their design.
pt_br: Porém, em uma escala a longo prazo, nós podemos criar alternativas ao uso de servidores. Por exemplo, nós podemos criar um programa ponto-a-ponto [peer-to-peer] através do qual colaboradores possam compartilhar dados criptografados. A comunidade de software livre deve desenvolver substitutos ponto-a-ponto distribuídos para &ldquo;aplicações web&rdquo; importantes. Pode ser sábio disponibilizá-los sob a <a href="/licenses/why-affero-gpl.html">GNU Affero GPL</a>, pois eles são prováveis candidatos a se converterem em programas baseados em servidor por outra pessoa. O <a href="/">Projeto GNU</a> está procurando voluntários para trabalhar em tais substitutos. Nós também convidamos outros projetos de software livre a considerarem essa questão em seu <em>design</em>.

source: See also:
pt_br: Veja também:

source: <a href="/philosophy/bug-nobody-allowed-to-understand.html">The Bug Nobody is Allowed to Understand</a>.
pt_br: <a href="/philosophy/bug-nobody-allowed-to-understand.html">O Erro que Ninguém Tem Permissão para Entender</a>.

source: *GNUN-SLOT: TRANSLATOR'S NOTES*
pt_br: O termo “thin client” foi mantido original dado seu comum uso em português, mas uma tradução não tão comum seria “cliente magro.”

source: Please send general FSF &amp; GNU inquiries to <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. There are also <a href="/contact/">other ways to contact</a> the FSF. Broken links and other corrections or suggestions can be sent to <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.
pt_br: Envie perguntas em geral sobre a FSF e o GNU para <a href="mailto:gnu@gnu.org">&lt;gnu@gnu.org&gt;</a>. Também existem <a href="/contact/">outros meios de contatar</a> a FSF. Links quebrados e outras correções ou sugestões podem ser enviadas para <a href="mailto:webmasters@gnu.org">&lt;webmasters@gnu.org&gt;</a>.

source: Please see the <a href="/server/standards/README.translations.html">Translations README</a> for information on coordinating and submitting translations of this article.
pt_br: A equipe de traduções para o português brasileiro se esforça para oferecer traduções acuradas e de boa qualidade, mas não estamos isentos de erros. Por favor, envie seus comentários e sugestões em geral sobre as traduções para <a href="mailto:web-translators@gnu.org">&lt;web-translators@gnu.org&gt;</a>. </p><p>Consulte o <a href="/server/standards/README.translations.html">Guia para as traduções</a> para mais informações sobre a coordenação e o envio de traduções das páginas desse site.

source: This page is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/">Creative Commons Attribution-NoDerivs 3.0 United States License</a>.
pt_br: Esta página está licenciada sob uma licença <a rel="license" href="http://creativecommons.org/licenses/by-nd/3.0/us/deed.pt_BR">Creative Commons Atribuição-SemDerivações 3.0 Estados Unidos</a>.

source: *GNUN-SLOT: TRANSLATOR'S CREDITS*
pt_br: <b>Tradução</b>: Rafael Ferreira <a href="mailto:rafael.f.f1@gmail.com">&lt;rafael.f.f1@gmail.com&gt;</a>, 2012; Hudson Flávio Meneses Lacerda, 2014

source: Updated:
pt_br: Última atualização:
